{
  "data": {
    "localSearch": {
      "localResources": {
        "nodes": [
          {
            "id": "1175676",
            "name": "Northgate Plaza",
            "addressLine1": "11030 5th Ave NE",
            "addressLine2": "",
            "postalCode": "98125",
            "isEnhanced": true,
            "isCareHome": false,
            "selfDescription": "<p>Conveniently located in the heart of the bustling Northgate retail area with easy access to the I-5 Freeway and local transit, Northgate Plaza offers high-quality care and an enriched lifestyle within a friendly North Seattle neighborhood.</p>\r\n\r\n<p>This includes full service independent living, and MBK’s person-centered assisted living program as well as short term and respite stays. Our community is within walking distance to Northgate Mall shops and restaurants and close to parks, houses of worship and a library. The Northgate neighborhood also has high-quality medical practices: Pacific Medical Center, Kindred Hospital, Group Health Clinic and UW Medicine. Northgate Plaza is truly a warm, friendly place full of interesting and active people. You will find us engaged in a variety of activities throughout the day when we aren’t enjoying the excellent cuisine of our chef or the peaceful landscaped gardens around the community. Our team of inspired associates is dedicated to enriching your life and providing a friendly, supportive environment for you and your loved one(s). Your four-legged furry friends are also welcome here.</p>\r\n",
            "averageCost": 3550,
            "averageRating": 4.1111,
            "foodRating": 0,
            "reviewCount": 9,
            "url": "https://www.caring.com/senior-living/washington/seattle/northgate-plaza",
            "websiteUrl": "http://www.merrillgardens.com/senior_living/Seattle_WA/zip_98125/merrill_gardens/3291",
            "primaryPhoneNumber": {
              "e164": "+12063636740",
              "formatted": "(206) 363-6740"
            }
          },
          {
            "id": "1224849",
            "name": "Maple Leaf Assisted Living & Memory Care",
            "addressLine1": "9001 Lake City Way NE",
            "addressLine2": "",
            "postalCode": "98115",
            "isEnhanced": true,
            "isCareHome": false,
            "selfDescription": "<p>At Maple Leaf, our community's culture is built on helping our residents find their happiest, healthiest selves. After hearing from multiple new residents that they were concerned about getting involved and making new friends, we formed a resident ambassador program, which pairs each new resident with an ambassador who helps them acclimate to Maple Leaf, engage in activities and events, and volunteer in the local community. A lot of our residents want to stay active, even during the dreary, rainy, Seattle winters, so we formed an indoor walking club and indoor gardening club, so they can appreciate the outside, inside. We also noticed that a lot of our residents were traveling to doctor's appointments and therapy visits, so now we're proud to offer a visiting physician service along with an in-house, on-site therapy facility, so our residents can get the care they need, right here, at home.</p><p>In short, when our residents talk, we listen. If you or a loved one are looking for a senior living community where residents are respected and heard, we'd love to meet you. Contact us today to schedule a tour.</p>",
            "averageCost": 4600,
            "averageRating": 4.1111,
            "foodRating": 0,
            "reviewCount": 9,
            "url": "https://www.caring.com/senior-living/washington/seattle/maple-leaf-assisted-living-memory-care",
            "websiteUrl": "https://www.mapleleafseniors.com",
            "primaryPhoneNumber": {
              "e164": "+12067291200",
              "formatted": "(206) 729-1200"
            }
          },
          {
            "id": "45063",
            "name": "Queen Anne Manor",
            "addressLine1": "100 Crockett Street",
            "addressLine2": "",
            "postalCode": "98109",
            "isEnhanced": true,
            "isCareHome": false,
            "selfDescription": "<p>Welcome to Queen Anne Manor, an historic building offering 4 comprehensive levels of care including Independent Living, Assisted Living, Transitional Care, and Memory Care. We are located in a serene neighborhood at the top of the hill in Queen Anne. Walking distance to grocery stores, restaurants, and quaint shops.</p><p>Caring for our residents is at the heart of what we do. Each new resident receives a custom-built care plan from our on-site RN that is designed with the resident's individual needs in mind. And it doesn't stop there: each staff member at Queen Anne, from the dining room servers to the front desk receptionist, work together to ensure each of our residents are their happiest, healthiest selves.</p>",
            "averageCost": 5900,
            "averageRating": 4,
            "foodRating": 0,
            "reviewCount": 9,
            "url": "https://www.caring.com/senior-living/washington/seattle/queen-anne-manor",
            "websiteUrl": "http://www.queenannemanor.com",
            "primaryPhoneNumber": {
              "e164": "+12062825001",
              "formatted": "(206) 282-5001"
            }
          },
          {
            "id": "45058",
            "name": "Ida Culver House Broadview",
            "addressLine1": "12505 Greenwood Avenue N",
            "addressLine2": null,
            "postalCode": "98133",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "<p>Welcome to Ida Culver House Broadview, an Era Living community. Ida Culver House offers a warm, vibrant lifestyle, a vast array of amenities, rich programming, and exceptional Independent Living, Assisted Living, Memory and Skilled Nursing care.</p>\r\n\r\n<p>Located in the Seattle neighborhood of Greenwood, Ida Culver House has breathtaking views of the Olympic Mountains and is close to parks, shops, and Seattle’s finest attractions. Ida Culver House has 245 residences, along with a 74-bed Skilled Nursing Health Care Center. A variety of floor plans are offered, including private cottage residences with garages.</p>\r\n\r\n<p>Residents of Ida Culver House experience a maintenance-free lifestyle, including a full service restaurant with chef-prepared selections, on-site Wellness Center staffed by a Registered Nurse, weekly housekeeping and linen services, scheduled transportation and professionally maintained common areas and gardens.</p>\r\n\r\n<p>Residents enjoy choosing from nearly 200 Life Enrichment events each month, including regular outings to the symphony and other cultural events, a variety of fitness, aquatic, and health classes, lectures, garden parties, chef demos, wine and jazz concerts, professionally curated art galas, and much more. Residents find that there are endless opportunities to pursue their passions, mingle with good friends, or simply sit back and enjoy the ambiance.</p>\r\n\r\n<p>In addition to Independent Living and Assisted Living, Ida Culver House Broadview's integrated campus offers specialized care for residents living with dementia, Alzheimer’s, and those seniors needing rehabilitation or skilled nursing services. From 24-hour rehabilitation nursing staff to physical and occupational therapists, speech-language pathologists and structured activities based on a variety of cognitive levels, Ida Culver House's 74-bed Medicare-certified Health Care Center is one of the top-rated skilled nursing communities in the area.</p>\r\n\r\n\r\n\r\n<p>*Rates are subject to change; care fees are not included in the monthly rate.</p>",
            "averageCost": null,
            "averageRating": 3.84615,
            "foodRating": 0,
            "reviewCount": 13,
            "url": "https://www.caring.com/senior-living/washington/seattle/ida-culver-house-broadview-98133",
            "websiteUrl": "http://www.eraliving.com/communities/broadview",
            "primaryPhoneNumber": {
              "e164": "+12063611989",
              "formatted": "(206) 361-1989"
            }
          },
          {
            "id": "45060",
            "name": "The Lakeshore",
            "addressLine1": "11448 Rainier Avenue S",
            "addressLine2": null,
            "postalCode": "98178",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "<p>Welcome to The Lakeshore, an Era Living community. The Lakeshore offers a warm, vibrant lifestyle, a vast array of amenities, rich programming, and exceptional Independent Living and Assisted Living care.</p>\r\n\r\n<p>The Lakeshore is located on the southern shore of Lake Washington with beautiful panoramic views. It has 156 apartments ranging from studios to two-bedroom suites.</p>\r\n\r\n<p>Residents of The Lakeshore experience a maintenance-free lifestyle, including a full service restaurant with chef-prepared selections, on-site Wellness Center staffed by a Registered Nurse, weekly housekeeping and linen services, scheduled transportation and professionally maintained common areas and gardens.</p>\r\n\r\n<p>Residents enjoy choosing from nearly 200 Life Enrichment events each month, including regular outings to the symphony and other cultural events, a variety of fitness and health classes, lectures, garden parties, chef demos, wine and jazz concerts, professionally curated art galas, and much more. Residents find that there are endless opportunities to pursue their passions, mingle with good friends, or simply sit back and enjoy the ambiance.</p>\r\n\r\n\r\n*Rates are subject to change; care fees are not included in the monthly rate",
            "averageCost": null,
            "averageRating": 4,
            "foodRating": 0,
            "reviewCount": 10,
            "url": "https://www.caring.com/senior-living/washington/seattle/the-lakeshore-98178",
            "websiteUrl": "http://www.eraliving.com/communities/lakeshore",
            "primaryPhoneNumber": {
              "e164": "+12067721200",
              "formatted": "(206) 772-1200"
            }
          },
          {
            "id": "1237925",
            "name": "GenCare Seattle: Ballard Landmark",
            "addressLine1": "5433 Leary Avenue NW",
            "addressLine2": null,
            "postalCode": "98107",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "<h4>Welcome to Gencare Lifestyle at The Ballard Landmark, Retirement Living in Seattle</h4>\r\n<h5>Senior and Assisted Living in Seattle</h5>\r\nGenCare Lifestyle at The Ballard Landmark is Seattle’s premier Independent and Assisted Senior Living Community.  The Ballard Landmark is situated in Seattle’s Ballard neighborhood, just minutes from highway 99 and I-5.  The centrally located Ballard Landmark, is 2 blocks from the Ballard Swedish Hospital, and walking distance to various grocery stores, dr. offices, the library, and a plethora of restaurants located within Ballard.\r\n \r\n<h4>Life at Ballard Landmark</h4>\r\n<p>With its ideal location in the heart of Ballard, GenCare Lifestyle at The Ballard Landmark gives its residents the opportunity to lead an active, healthy life full of new adventures and opportunities.  Sitting in the heart of the vibrant Ballard neighborhood allows for our residents to participate in events such as Ballard Seafood Fest, Syttende Mai, and the Ballard Art Walk.  Every Sunday, you can step outside the back door and into the Ballard Farmer’s Market.  The Ballard Landmark is your destination for a secure, pet-friendly, retirement living community in the city.\r\n</p>",
            "averageCost": null,
            "averageRating": 5,
            "foodRating": 0,
            "reviewCount": 4,
            "url": "https://www.caring.com/senior-living/washington/seattle/gencare-seattle-ballard-landmark",
            "websiteUrl": "http://www.ballardlandmark.com/",
            "primaryPhoneNumber": {
              "e164": "+12067824000",
              "formatted": "(206) 782-4000"
            }
          },
          {
            "id": "45054",
            "name": "Merrill Gardens at First Hill",
            "addressLine1": "1421 Minor Ave",
            "addressLine2": null,
            "postalCode": "98101",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "Merrill Gardens at First Hill is perfect for those who like being near boutique shopping, theaters, concert and lecture halls and much more. This friendly retirement community is in the First Hill neighborhood, where many of Seattle’s best known and highest quality medical practices are located.",
            "averageCost": 4800,
            "averageRating": 3.8889,
            "foodRating": 0,
            "reviewCount": 9,
            "url": "https://www.caring.com/senior-living/washington/seattle/merrill-gardens-at-first-hill-98101",
            "websiteUrl": "http://www.merrillgardens.com/senior_living/Seattle_WA/zip_98101/merrill_gardens/5385",
            "primaryPhoneNumber": {
              "e164": "+12063174955",
              "formatted": "(206) 317-4955"
            }
          },
          {
            "id": "45059",
            "name": "Ida Culver House Ravenna",
            "addressLine1": "2315 NE 65th Street",
            "addressLine2": "",
            "postalCode": "98115",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "<p>Welcome to Ida Culver House Ravenna, an Era Living community. Ida Culver House offers a warm, vibrant lifestyle, a vast array of amenities, rich programming, and exceptional Independent Living and Assisted Living care.</p>\r\n\r\n<p>Ida Culver House Ravenna is a community of 90 residences, nestled in the heart of the Ravenna/Bryant neighborhood. It's steps from shops, cafes, and restaurants, and is just minutes from the University of Washington campus and the University Village shopping center.</p>\r\n\r\n<p>Residents of Ida Culver House experience a maintenance-free lifestyle, including a full service restaurant with chef-prepared selections, on-site Wellness Center staffed by a Registered Nurse, weekly housekeeping and linen services, scheduled transportation and professionally maintained common areas and gardens.</p>\r\n\r\n<p>Residents enjoy choosing from nearly 200 Life Enrichment events each month, including regular outings to the symphony and other cultural events, a variety of fitness and health classes, lectures, garden parties, chef demos, wine and jazz concerts, professionally curated art galas, and much more. Residents find that there are endless opportunities to pursue their passions, mingle with good friends, or simply sit back and enjoy the ambiance.</p>\r\n\r\n\r\n<p>*Rates are subject to change; care fees are not included in the monthly rate.</p>",
            "averageCost": null,
            "averageRating": 4.6,
            "foodRating": 0,
            "reviewCount": 5,
            "url": "https://www.caring.com/senior-living/washington/seattle/ida-culver-house-ravenna-98115",
            "websiteUrl": "http://www.eraliving.com/communities/ravenna",
            "primaryPhoneNumber": {
              "e164": "+12065237315",
              "formatted": "(206) 523-7315"
            }
          },
          {
            "id": "45064",
            "name": "University House Wallingford",
            "addressLine1": "4400 Stone Way N",
            "addressLine2": null,
            "postalCode": "98103",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "<p>Welcome to University House Wallingford, an Era Living community. University House offers a warm, vibrant lifestyle, a vast array of amenities, rich programming, and exceptional Independent Living and Assisted Living care.</p>\r\n\r\n<p>University House is nestled in the heart of Wallingford, just steps from neighborhood shops, restaurants, cafes, a movie theater, and the library. There are 146 one and two-bedroom apartments.</p>\r\n\r\n<p>Residents of University House experience a maintenance-free lifestyle, including a full service restaurant with chef-prepared selections, on-site Wellness Center staffed by a Registered Nurse, weekly housekeeping and linen services, scheduled transportation and professionally maintained common areas and gardens.</p>\r\n\r\n<p>Residents enjoy choosing from nearly 200 Life Enrichment events each month, including regular outings to the symphony and other cultural events, a variety of fitness and health classes, lectures, garden parties, chef demos, wine and jazz concerts, professionally curated art galas, and much more. Residents find that there are endless opportunities to pursue their passions, mingle with good friends, or simply sit back and enjoy the ambiance.</p>\r\n\r\n<p>Additionally, University House Wallingford is proudly affiliated with the University of Washington Retirement Association. This affiliation provides residents with many benefits including a vibrant culture of distinct academic flavor, special access to University programs, and a commitment to lifelong learning.</p> \r\n\r\n\r\n<p>*Rates are subject to change; care fees are not included in the monthly rate.</p>",
            "averageCost": null,
            "averageRating": 4.5714,
            "foodRating": 0,
            "reviewCount": 7,
            "url": "https://www.caring.com/senior-living/washington/seattle/university-house-wallingford-98103",
            "websiteUrl": "http://www.eraliving.com/communities/wallingford",
            "primaryPhoneNumber": {
              "e164": "+12065458400",
              "formatted": "(206) 545-8400"
            }
          },
          {
            "id": "1233786",
            "name": "Brookdale Admiral Heights",
            "addressLine1": "2326 California Ave SW",
            "addressLine2": null,
            "postalCode": "98116",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "<p>We offer a home like setting and cheerful smiles from our professional staff who greet you every day. Our caring staff offers the assistance you need while respecting your independence.</p><p>Our peaceful setting, restaurant style dining experience, activities and beautiful setting combine to create a wonderful living environment everyday. Our genuine caring staff, home style meals, daily activities add to our residents' experience.</p><p>Through special events, activities, clubs and ongoing cultural enrichment programs, we offer unlimited opportunities for you to get to know other residents and us. Call to set up an appointment for a tour because we delight in showing you our home.</p><h5>Amenities and Services</h5><ul><li>Daily assistance with bathing and dressing</li><li>Medication management</li><li>Dining assistance and special diets</li><li>Assistance with reminders and redirection</li><li>Escorts and assistance with walking</li><li>Emergency response call system</li><li>Housekeeping</li><li>Laundry and linen service</li> </ul><p><i>*Rates subject to change at any time. Level of care not included.</i></p>",
            "averageCost": 3700,
            "averageRating": 3.4,
            "foodRating": 0,
            "reviewCount": 5,
            "url": "https://www.caring.com/senior-living/washington/seattle/brookdale-admiral-heights",
            "websiteUrl": "",
            "primaryPhoneNumber": {
              "e164": "+12069383964",
              "formatted": "(206) 938-3964"
            }
          },
          {
            "id": "1233783",
            "name": "Queen Anne Retirement Community",
            "addressLine1": "805 4th Ave N",
            "addressLine2": "",
            "postalCode": "98109",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "<p>We offer a home like setting and cheerful smiles from our professional staff who greet you every day. Our caring staff offers the assistance you need while respecting your independence.</p><p>Our peaceful setting, restaurant style dining experience, activities and beautiful setting combine to create a wonderful living environment everyday. Our genuine caring staff, home style meals, daily activities add to our residents' experience.</p><p>Through special events, activities, clubs and ongoing cultural enrichment programs, we offer unlimited opportunities for you to get to know other residents and us. Call to set up an appointment for a tour because we delight in showing you our home.</p><h5>Amenities and Services</h5><ul><li>Daily assistance with bathing and dressing</li><li>Medication management</li><li>Dining assistance and special diets</li><li>Assistance with reminders and redirection</li><li>Escorts and assistance with walking</li><li>Emergency response call system</li><li>Housekeeping</li><li>Laundry and linen service</li> </ul><p><i>*Rates subject to change at any time. Level of care not included.</i></p>",
            "averageCost": 3500,
            "averageRating": 4,
            "foodRating": 0,
            "reviewCount": 3,
            "url": "https://www.caring.com/senior-living/washington/seattle/queen-anne-retirement-community",
            "websiteUrl": "",
            "primaryPhoneNumber": {
              "e164": "+12062840055",
              "formatted": "(206) 284-0055"
            }
          },
          {
            "id": "1177057",
            "name": "Aljoya Thornton Place",
            "addressLine1": "450 Ne 100Th Street",
            "addressLine2": null,
            "postalCode": "98125",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "<p>Welcome to Aljoya Thornton Place, an Era Living community. Aljoya offers a warm, vibrant lifestyle, a vast array of amenities, rich programming, and exceptional Independent Living, Assisted Living, and wellness nursing services.</p> \r\n\r\n<p>Just steps from shops, restaurants, theaters, and more, Aljoya Thornton Place offers the perfect blend of village charm and contemporary lifestyle. Aljoya has 142 upscale residences, ranging from 540 to 1,450 square-feet.</p>\r\n\r\n<p>Residents of Aljoya experience a maintenance-free lifestyle, including a full service restaurant with chef-prepared selections, on-site Wellness Center staffed by a Registered Nurse, weekly housekeeping and linen services, scheduled transportation and professionally maintained common areas and gardens.</p>\r\n\r\n<p>Residents enjoy choosing from nearly 200 Life Enrichment events each month, including regular outings to the symphony and other cultural events, a variety of fitness, aquatic, and health classes, lectures, garden parties, chef demos, wine and jazz concerts, professionally curated art galas, and much more. Residents find that there are endless opportunities to pursue their passions, mingle with good friends, or simply sit back and enjoy the ambiance.</p>\r\n\r\n<p>*Rates are subject to change; care fees are not included in the monthly rate.</p>\r\n\r\n<h3>WHAT MAKES US SPECIAL</H3>\r\n\r\n<p>Era Living, a respected and recognized leader in retirement living throughout the Puget Sound, is a private, Seattle-based company founded by Eli and Rebecca Almo. Since 1987, Era Living has been dedicated to fostering a healthy and engaging environment of whole body wellness, culture, warmth and social fulfillment, providing exceptional healthcare services and enriching activities at all eight communities. Era Living's Wellness and Active Aging Programs are developed in collaboration with the University of Washington School of Nursing - one of the nation's top-rated nursing schools. It's this type of innovative and vibrant approach to senior living that makes Era Living communities so desirable.</p>",
            "averageCost": null,
            "averageRating": 5,
            "foodRating": 0,
            "reviewCount": 6,
            "url": "https://www.caring.com/senior-living/washington/seattle/aljoya-thornton-place-northgate-98125",
            "websiteUrl": "http://www.eraliving.com/communities/north-seattle",
            "primaryPhoneNumber": {
              "e164": "+12063067920",
              "formatted": "(206) 306-7920"
            }
          },
          {
            "id": "1239700",
            "name": "Terraces at Skyline at First Hill",
            "addressLine1": "715 9th Avenue",
            "addressLine2": null,
            "postalCode": "98104",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 3,
            "foodRating": 0,
            "reviewCount": 1,
            "url": "https://www.caring.com/senior-living/washington/seattle/terraces-at-skyline-at-first-hill-98104",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+12064071700",
              "formatted": "(206) 407-1700"
            }
          },
          {
            "id": "1175668",
            "name": "Northgate Retirement Community",
            "addressLine1": "11501 15th Avenue NE",
            "addressLine2": "",
            "postalCode": "98125",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "<p>We offer a home like setting and cheerful smiles from our professional staff who greet you every day. Our caring staff offers the assistance you need while respecting your independence.</p><p>Our peaceful setting, restaurant style dining experience, activities and beautiful setting combine to create a wonderful living environment everyday. Our genuine caring staff, home style meals, daily activities add to our residents' experience.</p><p>Through special events, activities, clubs and ongoing cultural enrichment programs, we offer unlimited opportunities for you to get to know other residents and us. Call to set up an appointment for a tour because we delight in showing you our home.</p><h5>Amenities and Services</h5><ul><li>Daily assistance with bathing and dressing</li><li>Medication management</li><li>Dining assistance and special diets</li><li>Assistance with reminders and redirection</li><li>Escorts and assistance with walking</li><li>Emergency response call system</li><li>Housekeeping</li><li>Laundry and linen service</li> </ul><p><i>*Rates subject to change at any time. Level of care not included.</i></p>",
            "averageCost": null,
            "averageRating": 3,
            "foodRating": 0,
            "reviewCount": 1,
            "url": "https://www.caring.com/senior-living/washington/seattle/northgate-retirement-community",
            "websiteUrl": "http://www.emeritus.com",
            "primaryPhoneNumber": {
              "e164": "+12063627250",
              "formatted": "(206) 362-7250"
            }
          },
          {
            "id": "1205146",
            "name": "Providence Mount St. Vincent AL",
            "addressLine1": "4831 35Th Ave Sw",
            "addressLine2": null,
            "postalCode": "98126",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "The Mount is a vibrant, elegant and innovative living care community for older adults that celebrates life, living and individual capability and is owned and operated by the Sisters of Providence and Providence Health & Services. As a resident, you will be treated with dignity and respect and empowered to work hand in hand with our staff to develop a plan of care that supports you, fits your lifestyle and honors your preferences.\r\n<br /><br />\r\nThe Mount is home to more than 400 older adults and others who need some type of assistance with their daily living or are in need of 24-hour care. Our residents enjoy supportive activities, programs and therapies to help them remain physically and mentally active as well as socially and spiritually engaged.",
            "averageCost": null,
            "averageRating": 5,
            "foodRating": 0,
            "reviewCount": 4,
            "url": "https://www.caring.com/senior-living/washington/seattle/providence-mount-st-vincent-al-98126",
            "websiteUrl": "http://www.providence.org",
            "primaryPhoneNumber": {
              "e164": "+12069373700",
              "formatted": "(206) 937-3700"
            }
          },
          {
            "id": "1237665",
            "name": "Daystar Retirement Village",
            "addressLine1": "2615 SW Barton Street",
            "addressLine2": null,
            "postalCode": "98126",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "<p>Welcome to Daystar Retirement Village, offering independent living, assisted living, and memory care services for seniors in Seattle, Washington.</p>\r\n\r\n<p>At Daystar Retirement Village, your quality of life is complemented by our safe, family atmosphere where every day moves at your own desired pace. The natural beauty, active lifestyle and caring staff are just a few of the reasons many people call Daystar Home. Daystar makes it easy to life your life your way.</p>",
            "averageCost": 3000,
            "averageRating": null,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/seattle/daystar-retirement-village-98126",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+12069376122",
              "formatted": "(206) 937-6122"
            }
          },
          {
            "id": "1234117",
            "name": "Park Place Retirement and Assisted Living",
            "addressLine1": "6900 37th Avenue South",
            "addressLine2": null,
            "postalCode": "98118",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "Park Place Assisted Living is an urban building in a park-like setting. Our residents enjoy our vibrant neighborhood with nearby access to doctors, shopping, public transportation, and restaurants.\r\n<br /><br />\r\nWe strive to enrich lives with passion and diversity. We understand that everyday activities can become difficult, and our friendly staff helps with these activities while encouraging each resident’s independence.\r\n<br /><br />\r\nOur residents enjoy a variety of social activities, which are directed by our residents’ preferences. At Park Place, we will help you with weekly light housekeeping and personal laundry. When it comes to dining, our chef meets personally with residents to learn preferences. We seek to create an environment where our residents can engage socially, feel secure, and have a sense of belonging.\r\n<br /><br />\r\nAt Park Place Assisted Living our mission is to provide housing options for older adults in an environment that enhances their quality of life physically, mentally, and spiritually.  \r\n<br /><br />\r\nPark Place Assisted Living is proud to be part of Retirement Housing Foundation (RHF). RHF is one of the nation’s largest non-profit providers of housing and services for older adults, persons with disabilities, and low-income families.\r\n",
            "averageCost": 3250,
            "averageRating": 4.1667,
            "foodRating": 0,
            "reviewCount": 6,
            "url": "https://www.caring.com/senior-living/washington/seattle/park-place-retirement-and-assisted-living-98118",
            "websiteUrl": "http://www.parkplaceassistedliving.org",
            "primaryPhoneNumber": {
              "e164": "+12067227275",
              "formatted": "(206) 722-7275"
            }
          },
          {
            "id": "1226005",
            "name": "The Kenney",
            "addressLine1": "7125 Fauntleroy Way SW",
            "addressLine2": null,
            "postalCode": "98136",
            "isEnhanced": false,
            "isCareHome": true,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 4.6,
            "foodRating": 0,
            "reviewCount": 5,
            "url": "https://www.caring.com/senior-living/washington/seattle/the-kenney",
            "websiteUrl": "http://www.thekenney.org/",
            "primaryPhoneNumber": {
              "e164": "+12069372800",
              "formatted": "(206) 937-2800"
            }
          },
          {
            "id": "1175683",
            "name": "Brookdale West Seattle",
            "addressLine1": "4611 35th Ave SW",
            "addressLine2": null,
            "postalCode": "98126",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "<p>We offer a home like setting and cheerful smiles from our professional staff who greet you every day. Our caring staff offers the assistance you need while respecting your independence.</p><p>Our peaceful setting, restaurant style dining experience, activities and beautiful setting combine to create a wonderful living environment everyday. Our genuine caring staff, home style meals, daily activities add to our residents' experience.</p><p>Through special events, activities, clubs and ongoing cultural enrichment programs, we offer unlimited opportunities for you to get to know other residents and us. Call to set up an appointment for a tour because we delight in showing you our home.</p><h5>Amenities and Services</h5><ul><li>Daily assistance with bathing and dressing</li><li>Medication management</li><li>Dining assistance and special diets</li><li>Assistance with reminders and redirection</li><li>Escorts and assistance with walking</li><li>Emergency response call system</li><li>Housekeeping</li><li>Laundry and linen service</li> </ul><p><i>*Rates subject to change at any time. Level of care not included.</i></p>",
            "averageCost": null,
            "averageRating": 4,
            "foodRating": 0,
            "reviewCount": 4,
            "url": "https://www.caring.com/senior-living/washington/seattle/brookdale-west-seattle",
            "websiteUrl": "http://www.emeritus.com",
            "primaryPhoneNumber": {
              "e164": "+12069325480",
              "formatted": "(206) 932-5480"
            }
          },
          {
            "id": "1225361",
            "name": "Bay Vista Commons",
            "addressLine1": "191 Russel Road",
            "addressLine2": null,
            "postalCode": "98312",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 4.25,
            "foodRating": 0,
            "reviewCount": 4,
            "url": "https://www.caring.com/senior-living/washington/seattle/bay-vista-commons-98312",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+13603778300",
              "formatted": "(360) 377-8300"
            }
          },
          {
            "id": "1235567",
            "name": "Aegis on Madison",
            "addressLine1": "2200 East Madison Street",
            "addressLine2": null,
            "postalCode": "98112",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 3.75,
            "foodRating": 0,
            "reviewCount": 4,
            "url": "https://www.caring.com/senior-living/washington/seattle/aegis-on-madison",
            "websiteUrl": "http://www.aegisliving.com/aegis-on-madison/contact-us/",
            "primaryPhoneNumber": {
              "e164": "+12062036348",
              "formatted": "(206) 203-6348"
            }
          },
          {
            "id": "1227408",
            "name": "Merrill Gardens at the University",
            "addressLine1": "5300 24th Avenue NE",
            "addressLine2": null,
            "postalCode": "98105",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "<p>Merrill Gardens at The University provides desirable retirement living near the University of Washington. Take advantage of the University Village outdoor shopping center and tree-lined Burke-Gilman trail; both ideal for strolling and just steps from the front door.</p>\r\n<p>Enjoy being close to a variety of stores, entertainment options and UW events. Medical practices—including those in downtown Seattle—are easy to get to. Merrill Gardens at The University shares its courtyard with an apartment complex that has created a multi-generational enclave and enhanced social opportunities. This complex, The Corydon, is owned and operated by the same parent company as Merrill Gardens.</p>",
            "averageCost": 4865,
            "averageRating": 3.25,
            "foodRating": 0,
            "reviewCount": 4,
            "url": "https://www.caring.com/senior-living/washington/seattle/merrill-gardens-at-the-university-98105",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+12069269738",
              "formatted": "(206) 926-9738"
            }
          },
          {
            "id": "1225696",
            "name": "Sea Mar Community Health Center",
            "addressLine1": "1040 S Henderson St",
            "addressLine2": null,
            "postalCode": "98108",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 4,
            "foodRating": 0,
            "reviewCount": 1,
            "url": "https://www.caring.com/senior-living/washington/seattle/sea-mar-community-health-center-98108",
            "websiteUrl": "http://www.seamar.org",
            "primaryPhoneNumber": {
              "e164": "+12067635210",
              "formatted": "(206) 763-5210"
            }
          },
          {
            "id": "1240058",
            "name": "The Loving Ones Adult Family Homes",
            "addressLine1": "2309 South 254th Court",
            "addressLine2": null,
            "postalCode": "98198",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 4,
            "foodRating": 0,
            "reviewCount": 3,
            "url": "https://www.caring.com/senior-living/washington/seattle/the-loving-ones-adult-family-homes-98198",
            "websiteUrl": "https://lovingonesafh.com/contact-us/contact-info/",
            "primaryPhoneNumber": {
              "e164": "+12068242121",
              "formatted": "(206) 824-2121"
            }
          },
          {
            "id": "1240324",
            "name": "Foss Home & Village",
            "addressLine1": "13023 Greenwwod Ave N",
            "addressLine2": null,
            "postalCode": "98133",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "Our assisted living village, located in North Seattle, is designed like a home not a hotel or apartment building. Surrounding an expansive, park-like grassy courtyard, our cottages offer private apartments with specially trained staff to provide services that are individually tailored to meet your needs.  The Village staff has an average of 9 years of service, providing assistance to the Foss residents, with key management averaging over 20 years.",
            "averageCost": null,
            "averageRating": 3.3333,
            "foodRating": 0,
            "reviewCount": 3,
            "url": "https://www.caring.com/senior-living/washington/seattle/foss-home-and-village-98133",
            "websiteUrl": "",
            "primaryPhoneNumber": {
              "e164": "+12063641300",
              "formatted": "(206) 364-1300"
            }
          },
          {
            "id": "1225780",
            "name": "Bailey Boushay House",
            "addressLine1": "2720 E Madison St",
            "addressLine2": null,
            "postalCode": "98112",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 5,
            "foodRating": 0,
            "reviewCount": 2,
            "url": "https://www.caring.com/senior-living/washington/seattle/bailey-boushay-house-98112",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+18885712015",
              "formatted": "(888) 571-2015"
            }
          },
          {
            "id": "1239683",
            "name": "Norse Home",
            "addressLine1": "5311 Phinney Ave N",
            "addressLine2": null,
            "postalCode": "98103",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/seattle/norse-home-98103",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+12067817400",
              "formatted": "(206) 781-7400"
            }
          },
          {
            "id": "1224686",
            "name": "Bayview",
            "addressLine1": "11 West Aloha St.",
            "addressLine2": null,
            "postalCode": "98119",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/seattle/bayview",
            "websiteUrl": "http://www.bayviewcommunity.org",
            "primaryPhoneNumber": {
              "e164": "+12062847330",
              "formatted": "(206) 284-7330"
            }
          },
          {
            "id": "1229662",
            "name": "Northaven Assisted Living",
            "addressLine1": "531 Northeast 112th Street",
            "addressLine2": null,
            "postalCode": "98125",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 4,
            "foodRating": 0,
            "reviewCount": 2,
            "url": "https://www.caring.com/senior-living/washington/seattle/northaven-assisted-living",
            "websiteUrl": "",
            "primaryPhoneNumber": {
              "e164": "+18772186539",
              "formatted": "(877) 218-6539"
            }
          },
          {
            "id": "1229570",
            "name": "Fred Lind Manor",
            "addressLine1": "1802 17th Avenue",
            "addressLine2": null,
            "postalCode": "98122",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 3.5,
            "foodRating": 0,
            "reviewCount": 2,
            "url": "https://www.caring.com/senior-living/washington/seattle/fred-lind-manor-98122",
            "websiteUrl": "http://www.fredlindmanor.com/",
            "primaryPhoneNumber": {
              "e164": "+12063241632",
              "formatted": "(206) 324-1632"
            }
          },
          {
            "id": "1238527",
            "name": "Heritage House At the Market",
            "addressLine1": "1533 Western Ave",
            "addressLine2": null,
            "postalCode": "98101",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 5,
            "foodRating": 0,
            "reviewCount": 1,
            "url": "https://www.caring.com/senior-living/washington/seattle/heritage-house-at-the-market-98101",
            "websiteUrl": "http://www.washington.providence.org",
            "primaryPhoneNumber": {
              "e164": "+12063824119",
              "formatted": "(206) 382-4119"
            }
          },
          {
            "id": "1367428",
            "name": "Aegis of West Seattle",
            "addressLine1": "4700 SW Admiral Way",
            "addressLine2": null,
            "postalCode": "98116",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 5,
            "foodRating": 0,
            "reviewCount": 1,
            "url": "https://www.caring.com/senior-living/washington/seattle/aegis-of-west-seattle",
            "websiteUrl": "https://www.aegisliving.com/aegis-of-west-seattle/contact-us/",
            "primaryPhoneNumber": null
          },
          {
            "id": "1249929",
            "name": "Nica Adult Family Home ",
            "addressLine1": "20002 20th Ave NW",
            "addressLine2": null,
            "postalCode": "98177",
            "isEnhanced": false,
            "isCareHome": true,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 5,
            "foodRating": 0,
            "reviewCount": 1,
            "url": "https://www.caring.com/senior-living/washington/seattle/nica-adult-family-home-98177",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+12065462436",
              "formatted": "(206) 546-2436"
            }
          },
          {
            "id": "1235143",
            "name": "Angelwings Adult Family Home",
            "addressLine1": "484 S 190th St",
            "addressLine2": null,
            "postalCode": "98148",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 5,
            "foodRating": 0,
            "reviewCount": 1,
            "url": "https://www.caring.com/senior-living/washington/seattle/angelwings-adult-family-home-98148",
            "websiteUrl": "http://www.angelwingshome.com",
            "primaryPhoneNumber": {
              "e164": "+12069888714",
              "formatted": "(206) 988-8714"
            }
          },
          {
            "id": "45061",
            "name": "Legacy House",
            "addressLine1": "803 S Lane",
            "addressLine2": null,
            "postalCode": "98104",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 4,
            "foodRating": 0,
            "reviewCount": 1,
            "url": "https://www.caring.com/senior-living/washington/seattle/legacy-house-98104",
            "websiteUrl": "http://www.legacyhouse.org",
            "primaryPhoneNumber": {
              "e164": "+12062925184",
              "formatted": "(206) 292-5184"
            }
          },
          {
            "id": "1220126",
            "name": "Gaffney House",
            "addressLine1": "1605 17th Avenue",
            "addressLine2": null,
            "postalCode": "98122",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 4,
            "foodRating": 0,
            "reviewCount": 1,
            "url": "https://www.caring.com/senior-living/washington/seattle/gaffney-house-98122",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+12068381930",
              "formatted": "(206) 838-1930"
            }
          },
          {
            "id": "1227521",
            "name": "Life Care Center of West Seattle",
            "addressLine1": "4700 SOUTHWEST ADMIRAL WAY",
            "addressLine2": null,
            "postalCode": "98116",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/seattle/life-care-center-of-west-seattle-98116",
            "websiteUrl": "http://lcca.com/109/",
            "primaryPhoneNumber": {
              "e164": "+12069352480",
              "formatted": "(206) 935-2480"
            }
          },
          {
            "id": "1242662",
            "name": "Arbor Heights Adult Family Home",
            "addressLine1": "10842 35th Ave SW",
            "addressLine2": null,
            "postalCode": "98146",
            "isEnhanced": false,
            "isCareHome": true,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 4,
            "foodRating": 0,
            "reviewCount": 1,
            "url": "https://www.caring.com/senior-living/washington/seattle/arbor-heights-adult-family-home-98146",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+12064391877",
              "formatted": "(206) 439-1877"
            }
          },
          {
            "id": "1308792",
            "name": "Rosewood Adult Family Home",
            "addressLine1": "19691 4th Avenue SW",
            "addressLine2": null,
            "postalCode": "98166",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 4,
            "foodRating": 0,
            "reviewCount": 1,
            "url": "https://www.caring.com/senior-living/washington/seattle/rosewood-adult-family-home",
            "websiteUrl": "",
            "primaryPhoneNumber": {
              "e164": "+18003610138",
              "formatted": "(800) 361-0138"
            }
          },
          {
            "id": "1248738",
            "name": "Merrill Gardens at Ballard",
            "addressLine1": "2418 Nw 56th St",
            "addressLine2": null,
            "postalCode": "98107",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "<p>Located in the Ballard neighborhood of Seattle, this new community will be ideally located near multiple restaurants, coffee shops and the famous Ballard Locks.</p>\r\n\r\n<p>We offer private apartments with generous living spaces and a choice of floor plans. Bring your small pet and all the personal touches that make your house a home. Dine when you want, as often as you like. Anytime Dining gives you the flexibility to enjoy your meals just like you did at home - on your schedule.</p>\r\n\r\n<p>Our Active Living calendar is driven by the desires of the people who live here - from fitness classes to charity work to games to outings - it's all at your fingertips.</p>\r\n\r\n",
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/seattle/merrill-gardens-at-ballard-98107",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+12068388555",
              "formatted": "(206) 838-8555"
            }
          },
          {
            "id": "45056",
            "name": "Foundation House at Northgate",
            "addressLine1": "11301 3rd Avenue NE",
            "addressLine2": "",
            "postalCode": "98125",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 3,
            "foodRating": 0,
            "reviewCount": 1,
            "url": "https://www.caring.com/senior-living/washington/seattle/foundation-house-at-northgate-98125",
            "websiteUrl": "http://www.foundationhouseng.com",
            "primaryPhoneNumber": {
              "e164": "+12063612758",
              "formatted": "(206) 361-2758"
            }
          },
          {
            "id": "1227284",
            "name": "Philanthropia Adult Family Home",
            "addressLine1": "2132 Boyer Ave E",
            "addressLine2": null,
            "postalCode": "98112",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 2,
            "foodRating": 0,
            "reviewCount": 1,
            "url": "https://www.caring.com/senior-living/washington/seattle/philanthropia-adult-family-home-98112",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+12063298500",
              "formatted": "(206) 329-8500"
            }
          },
          {
            "id": "1248190",
            "name": "The Summit At First Hill",
            "addressLine1": "1200 University St Suite 100",
            "addressLine2": null,
            "postalCode": "98101",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/seattle/the-summit-at-first-hill",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+12066524444",
              "formatted": "(206) 652-4444"
            }
          },
          {
            "id": "1248195",
            "name": "Hilltop Manor Boarding Home",
            "addressLine1": "1732 16Th Ave",
            "addressLine2": null,
            "postalCode": "98122",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/seattle/hilltop-manor-boarding-home-seattle",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+12063295775",
              "formatted": "(206) 329-5775"
            }
          },
          {
            "id": "1248260",
            "name": "Parkview Group Home",
            "addressLine1": "1114 15Th Ave E",
            "addressLine2": null,
            "postalCode": "98112",
            "isEnhanced": false,
            "isCareHome": true,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/seattle/parkview-group-home-seattle",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+12063244113",
              "formatted": "(206) 324-4113"
            }
          },
          {
            "id": "1248174",
            "name": "Aegis Of Queen Anne On Galer",
            "addressLine1": "223 West Galer St.",
            "addressLine2": null,
            "postalCode": "98199",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/seattle/aegis-of-queen-anne-on-galer",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+14252841633",
              "formatted": "(425) 284-1633"
            }
          },
          {
            "id": "1250467",
            "name": "Aegis of Queen Anne at Rodgers Park",
            "addressLine1": "2900 3rd Avenue",
            "addressLine2": null,
            "postalCode": "98119",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "Aegis of Queen Anne at Rodgers Park redefines assisted living as you know it. Located in one of the most desirable neighborhoods in the city, our newest community will meet your every need with the finest amenities, professional staff, enriching activities, and irresistible cuisine. You’ve spent your life preparing to live this sophisticated lifestyle.  It’s time to open the door to your new home.",
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/seattle/aegis-of-queen-anne-at-rodgers-park",
            "websiteUrl": "http://www.aegisliving.com/aegis-of-queen-anne-at-rodgers-park/",
            "primaryPhoneNumber": {
              "e164": "+12068589989",
              "formatted": "(206) 858-9989"
            }
          },
          {
            "id": "1248218",
            "name": "Transitional Resources",
            "addressLine1": "2970 Sw Avalon Way",
            "addressLine2": null,
            "postalCode": "98126",
            "isEnhanced": false,
            "isCareHome": true,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/seattle/transitional-resources",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+12068832050",
              "formatted": "(206) 883-2050"
            }
          },
          {
            "id": "45055",
            "name": "Fleming Home",
            "addressLine1": "8424 16th Avenue SW",
            "addressLine2": null,
            "postalCode": "98106",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/seattle/fleming-home",
            "websiteUrl": "http://www.fleminghome.com",
            "primaryPhoneNumber": {
              "e164": "+12067673137",
              "formatted": "(206) 767-3137"
            }
          },
          {
            "id": "1248258",
            "name": "Crown Hill Group Home",
            "addressLine1": "9523 15Th Ave Nw",
            "addressLine2": null,
            "postalCode": "98117",
            "isEnhanced": false,
            "isCareHome": true,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/seattle/crown-hill-group-home-seattle",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+12067824293",
              "formatted": "(206) 782-4293"
            }
          },
          {
            "id": "1248243",
            "name": "Beverly Park Group Home",
            "addressLine1": "150 Sw 114Th St",
            "addressLine2": null,
            "postalCode": "98146",
            "isEnhanced": false,
            "isCareHome": true,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/seattle/beverly-park-group-home-seattle",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+12062412049",
              "formatted": "(206) 241-2049"
            }
          },
          {
            "id": "1248217",
            "name": "High West Residence",
            "addressLine1": "15035 8Th Ave S",
            "addressLine2": null,
            "postalCode": "98148",
            "isEnhanced": false,
            "isCareHome": true,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/seattle/high-west-residence-seattle",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+12062413119",
              "formatted": "(206) 241-3119"
            }
          },
          {
            "id": "1222580",
            "name": "Overlake Terrace",
            "addressLine1": "2956 152nd Avenue NE",
            "addressLine2": null,
            "postalCode": "98052",
            "isEnhanced": true,
            "isCareHome": false,
            "selfDescription": "Our philosophy of service at Overlake Terrace Assisted Living and Independent Living encourages an active and independent senior lifestyle that supports residents' privacy and dignity. Our senior apartments are considered the premier Redmond senior retirement community. Overlake Terrace provides Independent Living, Assisted Living, Memory Care, and Respite and Adult Day Care services. Our community environment is rich in daily activities, with restaurant-style dining, graciously appointed interiors and apartment styles. Our senior housing environment provides full-service senior living with resort-style amenities in the heart of Washington, serving Bellevue, Bothell, Mercer Island, Redmond, Seattle, and surrounding communities. Come see for yourself.",
            "averageCost": 4300,
            "averageRating": 3.9231,
            "foodRating": 4.14285714285714,
            "reviewCount": 26,
            "url": "https://www.caring.com/senior-living/washington/redmond/overlake-terrace-98052",
            "websiteUrl": "https://www.stellarliving.com/overlake-terrace/",
            "primaryPhoneNumber": {
              "e164": "+14258830495",
              "formatted": "(425) 883-0495"
            }
          },
          {
            "id": "1176343",
            "name": "Sunrise of Bellevue",
            "addressLine1": "15928 NE 8th Street",
            "addressLine2": null,
            "postalCode": "98008",
            "isEnhanced": true,
            "isCareHome": false,
            "selfDescription": "<p>Located in Bellevue behind Crossroads Shopping Center, Sunrise of Bellevue is ideally situated on a quiet cul de sac - bordered by a park, community center, shops, restaurants and theaters. We pride ourselves in our tradition of excellence and compassion in meeting changing care needs. We also offer weekly nurse practitioner visits, support groups, lots of activities, transportation, great food and a loving staff. Residents at Sunrise enjoy the dignity of freedom and independence matched with the peace of mind that comes from knowing that care is always there, as they need it.</p><p>Step into a Sunrise Assisted Living community and you can't help but feel at home. We stop at nothing to make your experience warm and inviting, from our homelike exterior architecture, to our comfortable community areas and choice of suites to our exceptional outdoor gardens and landscaping. Look around and you'll notice fresh flowers throughout the residence, and you may even spot our dog or our cat. And of course, there are always the friendly smiling faces of our staff to ensure that each day spent here is a welcome one.</p>",
            "averageCost": null,
            "averageRating": 4.3889,
            "foodRating": 0,
            "reviewCount": 18,
            "url": "https://www.caring.com/senior-living/washington/bellevue/sunrise-of-bellevue-98008",
            "websiteUrl": "http://www.SunriseBellevue.com",
            "primaryPhoneNumber": {
              "e164": "+14254015152",
              "formatted": "(425) 401-5152"
            }
          },
          {
            "id": "45019",
            "name": "Mountlake Terrace Plaza",
            "addressLine1": "23303 58th Ave W",
            "addressLine2": "",
            "postalCode": "98043",
            "isEnhanced": true,
            "isCareHome": false,
            "selfDescription": "<p>Conveniently located in downtown Mountlake Terrace just 20 minutes north of Seattle, Mountlake Terrace Plaza is known for quality service and care within a warm, friendly community setting. </p>\r\n<p>This includes full-service independent living, MBK’s person-centered assisted living program as well as short term and respite stays. Explore the area’s large parks with walking paths and discover why it’s known for its natural beauty. The community is close to doctors, shopping centers, restaurants, the public library, community center and other essentials. Our welcoming atmosphere combined with our ideal neighborhood location makes our residents quickly feel at home. You will find us engaged in a variety of activities throughout the day when we aren’t enjoying the excellent cuisine of our chef or the peaceful landscaped gardens around the community. Our team of inspired associates is dedicated to enriching your life and providing a friendly, supportive environment for you and your loved one(s).</p>\r\n",
            "averageCost": 5145,
            "averageRating": 4.3571,
            "foodRating": 0,
            "reviewCount": 14,
            "url": "https://www.caring.com/senior-living/washington/mountlake-terrace/mountlake-terrace-plaza",
            "websiteUrl": "http://www.merrillgardens.com",
            "primaryPhoneNumber": {
              "e164": "+14256724673",
              "formatted": "(425) 672-4673"
            }
          },
          {
            "id": "44934",
            "name": "Claremont Senior Living",
            "addressLine1": "2707 Clare Avenue",
            "addressLine2": null,
            "postalCode": "98310",
            "isEnhanced": true,
            "isCareHome": false,
            "selfDescription": "<p>Senior assisted living at Claremont East offers residents the best of both worlds. All benefits of our senior living community are combined with a full spectrum of senior care services to create a premier senior assisted living community. Residents enjoy beautiful surroundings, on-site amenities and social programs alongside continual on-call medical care.</p>\r\n\r\n<p>At Claremont East, we adhere to state-of-the-art standards of senior assisted living while providing a special touch. Our residents receive personal and comprehensive care and are consistently treated with the dignity and respect they deserve. Whether our residents need help with day-to-day activities, getting to appointments, or medication management, our caregivers kindly and competently meet those needs.</p>\r\n\r\n<p>Our assisted living community in Bremerton has been purposefully designed to provide you or your loved one with a nurturing, comfortable, home-like environment that is attractive and easy to navigate. We foster community and family by hosting many activities and events each month. Residents are encouraged to participate in as many pursuits and outings as they like, appropriate to their ability. No matter what, everyone is treated as an individual person with unique needs.</p>\r\n<p>At Claremont East, our residents live life to its fullest as they age in place.</p>\r\n<h4>Assisted Living Amenities</h4>\r\n  <ul>\r\n        <li>Personalized Care Plans</li>\r\n        <li>24-hour Staffing</li>\r\n        <li>Emergency Response System</li>\r\n        <li>Medication Management</li>\r\n        <li>Scheduled transportation to local shopping and medical appointments</li>\r\n        <li>Award winning Wellness Everyday&trade; programs, provided 7 days a week</li>\r\n        <li>Dining for Wellness&trade; - educational and wellness program</li>\r\n        <li>Brain Health University&trade;</li>\r\n        <li>Beauty and Barber Shop</li>\r\n        <li>Housekeeping and maintenance service</li>\r\n        <li>All utilities and basic cable included </li>\r\n        <li>Individually controlled heat and central air</li>\r\n        <li>Fresh, seasonal cuisine prepared by the dining service team</li>\r\n</ul>\r\n",
            "averageCost": null,
            "averageRating": 4.2353,
            "foodRating": 0,
            "reviewCount": 17,
            "url": "https://www.caring.com/senior-living/washington/bremerton/claremont-senior-living-98310",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+13608528136",
              "formatted": "(360) 852-8136"
            }
          },
          {
            "id": "1240847",
            "name": "Sunrise of Lynnwood",
            "addressLine1": "21500 72nd Ave. W",
            "addressLine2": null,
            "postalCode": "98026",
            "isEnhanced": true,
            "isCareHome": false,
            "selfDescription": "<p>Step into a Sunrise Senior Living community and you can't help but feel at home. We stop at nothing to make your experience warm and inviting, from our homelike exterior architecture, to our comfortable community areas and choice of suites to our exceptional outdoor gardens and landscaping. Look around and you'll notice fresh flowers throughout the residence, and you may even spot our dog or our cat. And of course, there are always the friendly smiling faces of our staff to ensure that each day spent here is a welcome one.</p>\r\n\r\n<p>Sunrise is built on a commitment to our residents and their families. We believe no two people are alike, so the services and attention we provide should never be exactly the same. That's also why we offer a variety of lifestyle, service and care options. By providing these choices, we not only offer solutions for today, but we provide the security of knowing that there are options for tomorrow.</p>",
            "averageCost": 6090,
            "averageRating": 4.1111,
            "foodRating": 0,
            "reviewCount": 9,
            "url": "https://www.caring.com/senior-living/washington/edmonds/sunrise-of-lynnwood-98026",
            "websiteUrl": "",
            "primaryPhoneNumber": {
              "e164": "+14257763600",
              "formatted": "(425) 776-3600"
            }
          },
          {
            "id": "1176346",
            "name": "Sunrise of Edmonds",
            "addressLine1": "750 Edmonds Way",
            "addressLine2": null,
            "postalCode": "98020",
            "isEnhanced": true,
            "isCareHome": false,
            "selfDescription": "<p>Step into a Sunrise Assisted Living community and you can't help but feel at home. We stop at nothing to make your experience warm and inviting, from our homelike exterior architecture, to our comfortable community areas and choice of suites to our exceptional outdoor gardens and landscaping. Look around and you'll notice fresh flowers throughout the residence, and you may even spot our dog or our cat. And of course, there are always the friendly smiling faces of our staff to ensure that each day spent here is a welcome one.</p><p>Sunrise is built on a commitment to our residents and their families. We believe no two people are alike, so the services and attention we provide should never be exactly the same. That's also why we offer a variety of lifestyle, service and care options. By providing these choices, we not only offer solutions for today, but we provide the security of knowing that there are options for tomorrow.</p>",
            "averageCost": 6960,
            "averageRating": 3.4545,
            "foodRating": 0,
            "reviewCount": 11,
            "url": "https://www.caring.com/senior-living/washington/edmonds/sunrise-of-edmonds-98020",
            "websiteUrl": "http://www.SunriseEdmonds.com",
            "primaryPhoneNumber": {
              "e164": "+14256739700",
              "formatted": "(425) 673-9700"
            }
          },
          {
            "id": "1238333",
            "name": "Sagebrook Senior Living at Bellevue",
            "addressLine1": "15750 NE 15th ST",
            "addressLine2": "",
            "postalCode": "98008",
            "isEnhanced": true,
            "isCareHome": false,
            "selfDescription": "<p>Located East of Downtown Bellevue, Sagebrook Senior Living at Bellevue underwent a remodel in 2015. It is home to Independent Living, Assisted Living and Memory Care residents. Sagebrook at Bellevue is within walking distance of Crossroads Shopping Center and Crossroads Park.</p>\r\n\r\n<p>We offer a wide range of activities and services to accommodate you and your loved ones. At Sagebrook, you'll choose a floor plan that best suits your needs. Our apartments are spacious and well appointed. We invite you to stop by for a tour today. You'll see why we are the best value on the Eastside! Sagebrook is managed by Leisure Care which is renowned for it's amazing culture, numerous mouth watering culinary options, and staff that are dedicated in making a positive impact in every resident's life, every single day.</p>",
            "averageCost": 4200,
            "averageRating": 4,
            "foodRating": 4,
            "reviewCount": 8,
            "url": "https://www.caring.com/senior-living/washington/bellevue/sagebrook-at-bellevue",
            "websiteUrl": "",
            "primaryPhoneNumber": {
              "e164": "+14256414900",
              "formatted": "(425) 641-4900"
            }
          },
          {
            "id": "1217292",
            "name": "Madison House",
            "addressLine1": "12215 NE 128th St",
            "addressLine2": "",
            "postalCode": "98034",
            "isEnhanced": true,
            "isCareHome": false,
            "selfDescription": "<p>Madison House in located in Kirkland, Washington just east of Seattle. Our location is unbeatable when it comes to convenience. Madison House offers assistance as needed in an environment of personal independence. Each person is unique and we understand that needs and preferences vary.</p><p> Madison House offers an abundance of amenities and services designed to keep our seniors healthy and happy in a beautifully appointed environment.</p>",
            "averageCost": 6940,
            "averageRating": 4.4286,
            "foodRating": 0,
            "reviewCount": 7,
            "url": "https://www.caring.com/senior-living/washington/kirkland/madison-house-98034",
            "websiteUrl": "http://www.madisonhouseretirement.com",
            "primaryPhoneNumber": {
              "e164": "+14258218210",
              "formatted": "(425) 821-8210"
            }
          },
          {
            "id": "1239410",
            "name": "Madrona House",
            "addressLine1": "8800 Madison Avenue N",
            "addressLine2": null,
            "postalCode": "98110",
            "isEnhanced": true,
            "isCareHome": false,
            "selfDescription": "<p>Madrona House is wonderfully modern and thoroughly comfortable, Madrona House represents the next generation of assisted living care—offering a complete spectrum of services and assistance for residents. As well as something you don’t find every day in assisted living facilities, a true feeling of home.</p>\r\n\r\n<h4>Madrona House offers:</h4>\r\n<ul>\r\n<li>Apartments feature new hardwood flooring, beautiful textile carpet, and kitchens with built-in cabinets, microwaves and refrigerators</li>\r\n<li>Anytime dining with homemade breakfast, lunch, and dinner served in our intimate dining room</li>\r\n<li>In-house beauty salon</li>\r\n<li>Relaxation exercises</li>\r\n<li>Wireless internet throughout community</li>\r\n<li>Low-exertion aerobics</li>\r\n<li>Frequent and engaging excursions</li>\r\n<li>A physical therapy center, rooms for family gatherings, general dining, lounges, and activity spaces</li>\r\n</ul>\r\n\r\n<h4>Extended Services:</h4>\r\n<ul>\r\n<li>Dietary needs awareness and care</li>\r\n<li>Therapeutic interventions</li>\r\n<li>Personalized careplans</li>\r\n<li>Assisted living services, depending on level of care needed</li>\r\n</ul>\r\n\r\n<p>Madrona House offers the region’s most innovative care for people with dementia, with exclusive features specifically designed to assist the memory impaired. It’s a simple mission really – to enhance the life of each resident by addressing the special circumstances of Alzheimer’s disease and memory loss.</p>\r\n\r\n<h4>Madrona House offers:</h4>\r\n<ul>\r\n<li>Sensory stimulation</li>\r\n<li>Relaxation exercises</li>\r\n<li>In-house beauty salon</li>\r\n<li>Low-exertion aerobics</li>\r\n<li>Both assisted-living and memory-care services, allowing couples to stay in close proximity to each other</li>\r\n<li>A total of 51 apartments, including options for private or shared memory care accommodations</li>\r\n<li>Memory-care specialists</li>\r\n<li>Certified Nursing Assistance on site 24/7</li>\r\n<li>Open, airy, light-filled neighborhoods with intimate dining, family and private rooms</li>\r\n<li>Homemade breakfast, lunch and dinner, with healthy snacks available 24/7</li>\r\n<li>Caregiver to resident ratio: 1 to 5</li>\r\n<li>Individual \"neighborhoods\" accommodating 12 to 15 residents</li>\r\n<li>Resources and support for family members</li>\r\n</ul>\r\n\r\n<h4>Extended Services:</h4>\r\n<ul>\r\n<li>Walk-in tubs available</li>\r\n<li>Personalized care plans</li>\r\n<li>Dietary needs awareness and care</li>\r\n<li>Therapeutic interventions</li>\r\n</ul>",
            "averageCost": null,
            "averageRating": 4.6667,
            "foodRating": 4.66666666666667,
            "reviewCount": 6,
            "url": "https://www.caring.com/senior-living/washington/bainbridge-island/madrona-house",
            "websiteUrl": "http://www.bainbridgeseniorliving.com/assistedliving/madrona",
            "primaryPhoneNumber": {
              "e164": "+12063176000",
              "formatted": "(206) 317-6000"
            }
          },
          {
            "id": "1220831",
            "name": "Redmond Senior Living",
            "addressLine1": "15241 NE 20th St.",
            "addressLine2": "",
            "postalCode": "98007",
            "isEnhanced": true,
            "isCareHome": false,
            "selfDescription": "<p>We offer a home like setting and cheerful smiles from our professional staff who greet you every day. Our caring staff offers the assistance you need while respecting your independence.</p><p>Our peaceful setting, restaurant style dining experience, activities and beautiful setting combine to create a wonderful living environment everyday. Our genuine caring staff, home style meals, daily activities add to our residents' experience.</p><p>Through special events, activities, clubs and ongoing cultural enrichment programs, we offer unlimited opportunities for you to get to know other residents and us. Call to set up an appointment for a tour because we delight in showing you our home.</p><h5>Amenities and Services</h5><ul><li>Daily assistance with bathing and dressing</li><li>Medication management</li><li>Dining assistance and special diets</li><li>Assistance with reminders and redirection</li><li>Escorts and assistance with walking</li><li>Emergency response call system</li><li>Housekeeping</li><li>Laundry and linen service</li> </ul><p><i>*Rates subject to change at any time. Level of care not included.</i></p>",
            "averageCost": 5200,
            "averageRating": 4.8333,
            "foodRating": 0,
            "reviewCount": 6,
            "url": "https://www.caring.com/senior-living/washington/bellevue/redmond-senior-living",
            "websiteUrl": "http://www.emeritus.com/washington/bellevue/emeritus-bellevue?track=CARE",
            "primaryPhoneNumber": {
              "e164": "+14254010300",
              "formatted": "(425) 401-0300"
            }
          },
          {
            "id": "1176431",
            "name": "The Bellettini",
            "addressLine1": "1115 108th Ave NE",
            "addressLine2": "",
            "postalCode": "98004",
            "isEnhanced": true,
            "isCareHome": false,
            "selfDescription": "Here at The Bellettini, we're dedicated to offering a true sense of belonging to seniors and their families. It's a feeling you'll notice the moment you're invited to “make yourself at home” and continues through every thoughtful, personal detail. \r\n<br /><br />\r\nAs part of the WESTliving family, we understand the importance of world-class service. In fact, we even have a name for it: WESTclass service. We hire carefully and train extensively. The result? Team Members who are empowered to make a meaningful difference in the lives of those we serve and inspired to anticipate your next need - before you even know you have a next need. \r\n<br /><br />\r\nFrom independent living and assisted living the WESTliving experience creates and encourages a sense of belonging. Our culture of hospitality in senior living also promotes privacy, dignity and a sense of empowerment. A variety of activities including gardening, art classes, local tours and tai chi await here at The Bellettini. Not to mention it's right in the heart of Bellevue, Washington sitting next to the Bellevue Library. ",
            "averageCost": 6150,
            "averageRating": 4.4,
            "foodRating": 0,
            "reviewCount": 5,
            "url": "https://www.caring.com/senior-living/washington/bellevue/the-bellettini-98004",
            "websiteUrl": "http://www.thebellettini.com",
            "primaryPhoneNumber": {
              "e164": "+14254500800",
              "formatted": "(425) 450-0800"
            }
          },
          {
            "id": "1203359",
            "name": "Sunrise of Mercer Island",
            "addressLine1": "2959 76th Avenue SE",
            "addressLine2": null,
            "postalCode": "98040",
            "isEnhanced": true,
            "isCareHome": false,
            "selfDescription": "Step into a Sunrise community and you can't help but feel at home. We stop at nothing to make your experience warm and inviting, from our homelike exterior architecture, to our comfortable community areas and choice of suites to our exceptional outdoor gardens and landscaping. Look around and you'll notice fresh flowers throughout the residence, and you may even spot our dog or our cat. And of course, there are always the friendly smiling faces of our staff to insure that each day spent here is a welcome one.",
            "averageCost": 6000,
            "averageRating": 4,
            "foodRating": 0,
            "reviewCount": 5,
            "url": "https://www.caring.com/senior-living/washington/mercer-island/sunrise-of-mercer-island-98040",
            "websiteUrl": "http://www.SunriseMercerIsland.com",
            "primaryPhoneNumber": {
              "e164": "+12062326565",
              "formatted": "(206) 232-6565"
            }
          },
          {
            "id": "1218218",
            "name": "Kenmore Senior Living",
            "addressLine1": "7221 NE 182nd Street",
            "addressLine2": "",
            "postalCode": "98028",
            "isEnhanced": true,
            "isCareHome": false,
            "selfDescription": "<p>We offer a home like setting and cheerful smiles from our professional staff who greet you every day. Our caring staff offers the assistance you need while respecting your independence.</p><p>Our peaceful setting, restaurant style dining experience, activities and beautiful setting combine to create a wonderful living environment everyday. Our genuine caring staff, home style meals, daily activities add to our residents' experience.</p><p>Through special events, activities, clubs and ongoing cultural enrichment programs, we offer unlimited opportunities for you to get to know other residents and us. Call to set up an appointment for a tour because we delight in showing you our home.</p><h5>Amenities and Services</h5><ul><li>Daily assistance with bathing and dressing</li><li>Medication management</li><li>Dining assistance and special diets</li><li>Assistance with reminders and redirection</li><li>Escorts and assistance with walking</li><li>Emergency response call system</li><li>Housekeeping</li><li>Laundry and linen service</li> </ul><p><i>*Rates subject to change at any time. Level of care not included.</i></p>",
            "averageCost": null,
            "averageRating": 4.3333,
            "foodRating": 0,
            "reviewCount": 3,
            "url": "https://www.caring.com/senior-living/washington/kenmore/kenmore-senior-living",
            "websiteUrl": "http://www.emeritus.com/washington/kenmore/spring-estates?track=CARE",
            "primaryPhoneNumber": {
              "e164": "+14254814200",
              "formatted": "(425) 481-4200"
            }
          },
          {
            "id": "45013",
            "name": "Island House",
            "addressLine1": "7810 SE 30th St",
            "addressLine2": "",
            "postalCode": "98040",
            "isEnhanced": true,
            "isCareHome": false,
            "selfDescription": "<p>Located in the heart of Mercer Island with easy access to the cities of Seattle and Bellevue, Island House is a warm, vibrant community with an active, service-enriched lifestyle and high-quality personalized care.</p>\r\n\r\n<p>This includes full service independent living and MBK’s person-centered assisted living program, as well as short term and respite stays. Island House is a stroll away from Mercer Island’s quaint shops and cafes with easy access to local medical offices, banks, the post office and other services. Nearby you will find Luther Burbank Park, a 77-acre nature sanctuary with lake views and a multitude of outdoor activities. With like-minded people and dedicated caring associates to enjoy each day, you may experience the individual support and comfortable friendships that make our intimate village community feel like home. Your four-legged furry friends are also welcome here.\r\n</p>",
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/mercer-island/island-house",
            "websiteUrl": "http://www.merrillgardens.com",
            "primaryPhoneNumber": {
              "e164": "+12062360502",
              "formatted": "(206) 236-0502"
            }
          },
          {
            "id": "1369959",
            "name": "Sunrise of Issaquah",
            "addressLine1": "23599 SE Issaquah Fall City Rd.",
            "addressLine2": "",
            "postalCode": "98029",
            "isEnhanced": true,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": null,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/issaquah/sunrise-of-issaquah",
            "websiteUrl": "",
            "primaryPhoneNumber": {
              "e164": "+14259450006",
              "formatted": "(425) 945-0006"
            }
          },
          {
            "id": "45032",
            "name": "Park Vista by Bonaventure",
            "addressLine1": "2944 SE Lund Avenue",
            "addressLine2": null,
            "postalCode": "98366",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": ".<h4>Life on your terms</h4><p>Bonaventure is all about one thing: life on your terms. That's why so many people choose a Bonaventure community after they've looked at the other options. It's also why so many doctors, referral agencies, churches and others, not to mention 96% of our residents, enthusiastically recommend us to their friends and families.</p><p>We care about what home means to you. We're dedicated to giving you a caring, lively, comfortable, affordable place to make your home. We want it to be filled with family, fun, new experiences and exactly the amount of expert help and care you desire, from a little to a lot.</p><h4>Home Cooking</h4><p>Enough with the philosophy, let's talk food! Our in-house chef makes your meals from scratch every day, they don't come from a can. Our healthy and delicious food is often listed as a reason people make their homes here. It is so tasty, you'll be happy we have physical activities and easy fitness programs to keep you from putting on a few pounds! Don't just take our word for it; make us put our money where your mouth is. We invite you to come by for lunch or dinner. It's on us. You can meet new friends and get their opinion on our quality and service.</p><h4>Transportation</h4><p>Whether you're going to the symphony or the supermarket, we're here for you. Compare our transportation options to the others and you'll see how easy we make it to stay on the go.</p><h4>Freedom & Choice</h4><p>Your home at Bonaventure offers you the choices you need to maintain your freedom, so you can enjoy life on your terms. Spend your days enjoying our sunny walking paths, well-stocked libraries and places to garden while relying on us for vital services like top-notch building security and advanced emergency call systems.</p><h4>Begin the Adventure</h4><p>Start something new and exciting in your life. There's no place like home, especially when it's your home at a Bonaventure Senior Living community. If we're right for you, you'll know it 10 minutes after you walk in the door. Come explore your next chapter</p>",
            "averageCost": null,
            "averageRating": 3.5833,
            "foodRating": 4.66666666666667,
            "reviewCount": 24,
            "url": "https://www.caring.com/senior-living/washington/port-orchard/park-vista-by-bonaventure",
            "websiteUrl": "",
            "primaryPhoneNumber": {
              "e164": "+13603294507",
              "formatted": "(360) 329-4507"
            }
          },
          {
            "id": "1176438",
            "name": "Fairwinds - Brighton Court",
            "addressLine1": "6520 196th St. SW",
            "addressLine2": null,
            "postalCode": "98036",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "<p>Fairwinds - Brighton Court, located near the heart of downtown Lynnwood in a beautiful wooded area, offers luxurious apartment homes in a fun and active retirement community. We are very proud to be managed by Leisure Care, who, for over 30 years, has led the industry in the development and management of elegant retirement communities that are all about Five-Star Fun. At Fairwinds - Brighton Court we have set colossal standards for quality and choice in guest services, amenities, resort-style living, and in all things \"fun.\"</p><p>Live at Fairwinds - Brighton Court and enjoy your own private apartment home, and fill it with your own treasured belongings. Meet new friends and entertain family in the beautifully appointed dining room. We offer true restaurant dining, and all meals are prepared for you by our very own chef. Then there's the programs! Sign up for an art class. Start a new fitness program. Or book that travel excursion you've always wanted to. You will be amazed by how many fun social and recreational activities there are just waiting for you. Whether you want to spend an afternoon in the library with a good book, join a morning stretch class, enjoy a night on the town with your sweetie, or want to socialize with friends, Fairwinds - Brighton Court has it all. Our location also allows residents to enjoy all that Lynnwood has to offer. We are close to shopping centers, banks, medical facilities, and other support services. </p><p>Imagine the peace of mind knowing that our highly-trained staff is available 24 hours a day to answer any questions you may have and that every apartment is equipped with an emergency communication system. And if you need some assistance, whether a little or a lot, our Assisted Living services are available and can be started at any time.</p><p>Quite simply, at Fairwinds - Brighton Court, it's your life, on your terms. We help make it all possible. Come join us for Five-Star Fun. \r\n</p>",
            "averageCost": null,
            "averageRating": 4.625,
            "foodRating": 0,
            "reviewCount": 8,
            "url": "https://www.caring.com/senior-living/washington/lynnwood/fairwinds-brighton-court-98036",
            "websiteUrl": "http://www.seniorsforliving.com/community/Fairwinds--Brighton-Court/",
            "primaryPhoneNumber": {
              "e164": "+14257754440",
              "formatted": "(425) 775-4440"
            }
          },
          {
            "id": "1226607",
            "name": "Judson Park",
            "addressLine1": "23600 Marine View Dr S",
            "addressLine2": null,
            "postalCode": "98198",
            "isEnhanced": false,
            "isCareHome": true,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 3.3333,
            "foodRating": 0,
            "reviewCount": 3,
            "url": "https://www.caring.com/senior-living/washington/des-moines/judson-park-98198",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+18004014113",
              "formatted": "(800) 401-4113"
            }
          },
          {
            "id": "45053",
            "name": "El Dorado West",
            "addressLine1": "1010 SW 134th Street",
            "addressLine2": null,
            "postalCode": "98146",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "<p>Celebrating more than 30 years in the Burien community, El Dorado West is a gracious, single story building surrounding a lovely garden courtyard.</p>\r\n<p>El Dorado West is conveniently located close to Seahurst Park, Salmon Creek, Puget Sound, and not far from the Sea-Tac Airport. Relax and enjoy retirement amidst a\r\nthoughtful, caring community with access to excellent health care facilities, shopping malls, bus lines, and the excitement of downtown Seattle.<p>",
            "averageCost": null,
            "averageRating": 3.6429,
            "foodRating": 3.4,
            "reviewCount": 14,
            "url": "https://www.caring.com/senior-living/washington/burien/el-dorado-west-retirement-and-assisted-living-98146",
            "websiteUrl": "http://www.villageconcepts.com",
            "primaryPhoneNumber": {
              "e164": "+12062481975",
              "formatted": "(206) 248-1975"
            }
          },
          {
            "id": "44992",
            "name": "University House Issaquah",
            "addressLine1": "22975 SE Black Nugget Road",
            "addressLine2": null,
            "postalCode": "98029",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "<p>Welcome to University House Issaquah, an Era Living community. University House offers a warm, vibrant lifestyle, a vast array of amenities, rich programming, and exceptional Independent Living and Assisted Living care.</p> \r\n\r\n<p>University House is nestled among the foothills of the beautiful Cascade Mountains, and is just minutes from the arts, fine dining, and shopping. There are 184 apartments ranging from spacious studios to expansive three-bedroom penthouse suites.</p>\r\n\r\n<p>Residents of University House experience a maintenance-free lifestyle, including a full service restaurant with chef-prepared selections, on-site Wellness Center staffed by a Registered Nurse, weekly housekeeping and linen services, scheduled transportation and professionally maintained common areas and gardens.</p>\r\n\r\n<p>Residents enjoy choosing from nearly 200 Life Enrichment events each month, including regular outings to the symphony and other cultural events, a variety of fitness, aquatic, and health classes, lectures, garden parties, chef demos, wine and jazz concerts, professionally curated art galas, and much more. Residents find that there are endless opportunities to pursue their passions, mingle with good friends, or simply sit back and enjoy the ambiance.</p>\r\n\r\n<p>Additionally, University House Issaquah is proudly affiliated with the University of Washington Retirement Association. This affiliation provides residents with many benefits including a vibrant culture of distinct academic flavor, special access to University programs, and a commitment to lifelong learning.</p>\r\n\r\n\r\n<p>*Rates are subject to change; care fees are not included in the monthly rate.</p>",
            "averageCost": null,
            "averageRating": 4.7143,
            "foodRating": 0,
            "reviewCount": 7,
            "url": "https://www.caring.com/senior-living/washington/issaquah/university-house-issaquah-98029",
            "websiteUrl": "http://www.eraliving.com/communities/issaquah",
            "primaryPhoneNumber": {
              "e164": "+14255574200",
              "formatted": "(425) 557-4200"
            }
          },
          {
            "id": "1217293",
            "name": "Fairwinds - Redmond",
            "addressLine1": "9988 Avondale Rd Ne",
            "addressLine2": null,
            "postalCode": "98052",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "<p>Located in the heart of Redmond at the corner of Avondale and Novelty Hill Road, Fairwinds - Redmond offers luxurious apartment homes in a fun and active retirement community. </p>\r\n \r\n<p>Fairwinds - Redmond is a Built Green Certified community.</p>\r\n \r\n<p>We are very proud to be managed by Leisure Care, who, for over 30 years, has led the industry in the development and management of elegant retirement communities that are all about <span style=\"font-style:italic\">Five-Star Fun. At Fairwinds</span> - Redmond we have set colossal standards for quality and choice in guest services, amenities, resort-style living, and in all things \"fun.\" It is no wonder Leisure Care's legendary commitment to quality and service has earned the trust of thousands of residents and their families. </p>\r\n\r\n<p>Live at Fairwinds - Redmond and enjoy your own private apartment home, and fill it with your own treasured belongings if you wish. Meet new friends and entertain family at Red Sky, our onsite restaurant. We will offer true restaurant dining, and all meals will be prepared for you by Fairwinds \"“ Redmond's very own chef. Then there's the programs! Sign up for an art class. Start a new fitness program. Or book that travel excursion you've always wanted to. These are just a few reasons to love Fairwinds - Redmond. But read on, there's much more.</p> \r\n\r\n<p>Imagine the peace of mind knowing that our highly-trained staff is available 24 hours a day to answer any questions you may have and that every apartment is equipped with an emergency communication system. And if you need some assistance, whether a little or a lot, our Assisted Living services are available and can be started at any time, and without having to change apartments.</p> \r\n\r\n<p>You will be amazed by how many fun social and recreational activities there are just waiting for you. Or, if you prefer a little solitude, enjoy the peace and quiet of your apartment home or escape to one of the many quiet common spaces. Whether you want to spend an afternoon in the library with a good book, swim laps in the pool, enjoy a night on the town with your sweetie, or want to socialize with friends, Fairwinds - Redmond has it all. Do what you want, whenever you want to. </p>\r\n\r\n<p>Quite simply, at Fairwinds - Redmond, it's your life, on your terms. We help make it all possible. Come join us for <span style=\"font-style:italic\">Five-Star Fun</span>.</p> \r\n",
            "averageCost": null,
            "averageRating": 4.3,
            "foodRating": 0,
            "reviewCount": 10,
            "url": "https://www.caring.com/senior-living/washington/redmond/fairwinds-redmond-98052",
            "websiteUrl": "http://www.fairwindsredmond.com",
            "primaryPhoneNumber": {
              "e164": "+14255584700",
              "formatted": "(425) 558-4700"
            }
          },
          {
            "id": "1175675",
            "name": "Merrill Gardens at Kirkland",
            "addressLine1": "14 Main Street South",
            "addressLine2": null,
            "postalCode": "98033",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "Merrill gardens at Kirkland is located just a block east of lake Washington right in downtown Kirkland, Washington, steps to everything you could ever need or want. The community offers 115 well appointed apartments, studio, one and two bedroom, a fitness center, movie theater and wine bar &amp; bistro to name a few of our outstanding features. We are walking distance to shopping, local restaurants, parks, swimming pool and banking all with in a small town feel.\r\n<br><br>\r\nLiving at Merrill Gardens at Kirkland gives you the freedom to be yourself and then some! Our communities are a month to month rental, no buy in required. We include all utilities except for your telephone, cable television,once per week housekeeping and linen service, comfortable living areas and social meeting areas, one meal per day from our anytime dining served restaurant style along with a full kitchen or kitchenette in your apartment, 24 hour staff,available assisted living services, full activity program, resident call system in your apartments if needed and on site maintenance. Small pets are welcome!\r\n<br><br>\r\nOur location is close to Evergreen and Overlake medical centers for any of your health care needs and we provide scheduled transportation to and from your appointments.  We also offer Concierge services and a beauty salon and barber shop to fit your busy lifestyle.\r\n<br><br>\r\nWe know you will agree! Merrill Gardens at Kirkland is a one of a kind retirement community. Please contact us for a personalized tour.\r\n<br><br>",
            "averageCost": null,
            "averageRating": 4.6,
            "foodRating": 0,
            "reviewCount": 10,
            "url": "https://www.caring.com/senior-living/washington/kirkland/merrill-gardens-at-kirkland-98033",
            "websiteUrl": "http://www.merrillgardens.com",
            "primaryPhoneNumber": {
              "e164": "+14252964588",
              "formatted": "(425) 296-4588"
            }
          },
          {
            "id": "1227526",
            "name": "Life Care Center of Kirkland",
            "addressLine1": "10101 Northeast 120th Street",
            "addressLine2": null,
            "postalCode": "98034",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 4.5,
            "foodRating": 0,
            "reviewCount": 2,
            "url": "https://www.caring.com/senior-living/washington/kirkland/life-care-center-of-kirkland-98034",
            "websiteUrl": "http://lcca.com/95/",
            "primaryPhoneNumber": {
              "e164": "+14258232323",
              "formatted": "(425) 823-2323"
            }
          },
          {
            "id": "1177036",
            "name": "Fairwinds - Brittany Park",
            "addressLine1": "17143 133rd Avenue NE",
            "addressLine2": null,
            "postalCode": "98072",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "<p>Brittany Park, newly remodeled and located in the heart of Woodinville, Washington, offers luxurious apartment homes for seniors 62 and over in a fun and active retirement and independent living community.</p><p>Brittany Park is very proud to be managed by Leisure Care, which for 30 years has led the industry in the development and management of elegant retirement communities that are all about fun. In search of comfortable senior housing in Washington? We have set colossal standards for quality and choice in assisted living, guest services, amenities, resort-style living, and in all things \"fun.\"  </p><p>Meet new friends and entertain family in the beautifully appointed dining room of this senior living community. We offer true restaurant dining, and all meals are prepared by our very own chef.</p><p>Sign up for an art class, start a new fitness program, exercise your brain in our Brain Fitness Center, or book that travel excursion you've always wanted to. At Brittany Park the possibilities of independent living are endless.</p><p>Quite simply, at Brittany Park it's your life on your terms. We help make it all possible. Come join us for \"Five-Star Fun.\"</p>",
            "averageCost": null,
            "averageRating": 4.2,
            "foodRating": 0,
            "reviewCount": 5,
            "url": "https://www.caring.com/senior-living/washington/woodinville/fairwinds-brittany-park-98072",
            "websiteUrl": "http://www.seniorsforliving.com/community/Fairwinds---Brittany-Park/",
            "primaryPhoneNumber": {
              "e164": "+14254027100",
              "formatted": "(425) 402-7100"
            }
          },
          {
            "id": "1203926",
            "name": "Brookdale Renton",
            "addressLine1": "71 SW Victoria Street",
            "addressLine2": null,
            "postalCode": "98057",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "<p>We offer a home like setting and cheerful smiles from our professional staff who greet you every day. Our caring staff offers the assistance you need while respecting your independence.</p><p>Our peaceful setting, restaurant style dining experience, activities and beautiful setting combine to create a wonderful living environment everyday. Our genuine caring staff, home style meals, daily activities add to our residents' experience.</p><p>Through special events, activities, clubs and ongoing cultural enrichment programs, we offer unlimited opportunities for you to get to know other residents and us. Call to set up an appointment for a tour because we delight in showing you our home.</p><h5>Amenities and Services</h5><ul><li>Daily assistance with bathing and dressing</li><li>Medication management</li><li>Dining assistance and special diets</li><li>Assistance with reminders and redirection</li><li>Escorts and assistance with walking</li><li>Emergency response call system</li><li>Housekeeping</li><li>Laundry and linen service</li> </ul><p><i>*Rates subject to change at any time. Level of care not included.</i></p>",
            "averageCost": null,
            "averageRating": 3.1,
            "foodRating": 0,
            "reviewCount": 10,
            "url": "https://www.caring.com/senior-living/washington/renton/brookdale-renton",
            "websiteUrl": "http://www.emeritus.com/washington/renton/emeritus-renton?track=CARE",
            "primaryPhoneNumber": {
              "e164": "+14252268977",
              "formatted": "(425) 226-8977"
            }
          },
          {
            "id": "44929",
            "name": "Chateau at Bothell Landing",
            "addressLine1": "17543 102nd Avenue NE",
            "addressLine2": "",
            "postalCode": "98011",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 4.6667,
            "foodRating": 0,
            "reviewCount": 9,
            "url": "https://www.caring.com/senior-living/washington/bothell/chateau-at-bothell-landing-98011",
            "websiteUrl": "http://www.chateaullc.com",
            "primaryPhoneNumber": {
              "e164": "+14254851155",
              "formatted": "(425) 485-1155"
            }
          },
          {
            "id": "1175682",
            "name": "Merrill Gardens at Renton Centre",
            "addressLine1": "104 Burnett Avenue S",
            "addressLine2": null,
            "postalCode": "98057",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "Merrill Gardens at Renton Centre is located in downtown Renton across from the new transit center, near shopping and restaurants. Our apartment-style community offers all of the amenities of a home without the work. Imagine a life without household chores, yard work or home maintenance. Invite guests to a meal, special event or social outing. With our on-site Active Living Director, scheduled transportation and Anytime Dining program - there are opportunities to make new friends or entertain old ones right outside your front door. Welcome to Merrill Gardens, a one of a kind retirement community.  Call today to reserve your apartment!\r\n<br> <br>\r\nMerrill Gardens at Renton Centre offers independent living, assisted living and respite care.\r\n",
            "averageCost": 4100,
            "averageRating": 4.5556,
            "foodRating": 0,
            "reviewCount": 9,
            "url": "https://www.caring.com/senior-living/washington/renton/merrill-gardens-at-renton-centre-98057",
            "websiteUrl": "http://www.merrillgardens.com",
            "primaryPhoneNumber": {
              "e164": "+14252721193",
              "formatted": "(425) 272-1193"
            }
          },
          {
            "id": "44936",
            "name": "Cascades of Bremerton",
            "addressLine1": "3201 Pine Road NE",
            "addressLine2": null,
            "postalCode": "98310",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 3,
            "foodRating": 0,
            "reviewCount": 1,
            "url": "https://www.caring.com/senior-living/washington/bremerton/cascades-of-bremerton",
            "websiteUrl": "http://www.thewillowsbremerton.com",
            "primaryPhoneNumber": {
              "e164": "+13604798522",
              "formatted": "(360) 479-8522"
            }
          },
          {
            "id": "1225915",
            "name": "Normandy Park Assisted Living",
            "addressLine1": "16625 1st Ave S",
            "addressLine2": null,
            "postalCode": "98148",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 4.1111,
            "foodRating": 0,
            "reviewCount": 9,
            "url": "https://www.caring.com/senior-living/washington/normandy-park/normandy-park-assisted-living-98148",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+12065391629",
              "formatted": "(206) 539-1629"
            }
          },
          {
            "id": "1225273",
            "name": "The Lodge at Eagle Ridge",
            "addressLine1": "1600 S. Eagle Ridge Drive",
            "addressLine2": null,
            "postalCode": "98055",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "<h4>Renton Senior and Assisted Living:</h4>\r\n<p>Tucked away, on the hillside just above Downtown Renton, The Lodge at Eagle Ridge gives its residents all the conveniences of being in the city, along with the quiet and privacy to relax and enjoy your retirement!  Located just off of I-405, The Lodge provides easy access to nearby shopping centers (South Center Mall, Renton Landing), world class medical facilities (Pac-Med, Group Health, Valley Medical Center, UW Medicine Clinics), and all the restaurants and activities, Renton has to offer.  \r\n</p> \r\n<h4>Life at The Lodge:</h4>\r\n<p>While being located in the heart of Renton, The Lodge offers its Residents a quiet, peaceful place to enjoy their retirement.  Residents can enjoy a gourmet meal in our Dining Room while admiring the views of Lake Washington and The Olympic Mountains.  Or, take a walk around the community on our quarter-mile, paved walking path, through our beautifully manicured grounds, originally designed by Tom Kubota.  The Lodge at Eagle Ridge is a pet-friendly retirement living community dedicated to helping you to make the most out of your senior living experience.\r\n</p>",
            "averageCost": null,
            "averageRating": 4.125,
            "foodRating": 0,
            "reviewCount": 8,
            "url": "https://www.caring.com/senior-living/washington/renton/the-lodge-at-eagle-ridge",
            "websiteUrl": "http://www.thelodgeateagleridge.com/",
            "primaryPhoneNumber": {
              "e164": "+14257938080",
              "formatted": "(425) 793-8080"
            }
          },
          {
            "id": "1176347",
            "name": "Aegis of Issaquah",
            "addressLine1": "780 Northwest Juniper Street",
            "addressLine2": null,
            "postalCode": "98027",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "Step onto our lovely grounds and marvel at our seven thoughtfully-designed cottages. You'll find exceptional Assisted Living services and dedicated care for those with Alzheimer's or other dementia. Surrounded by walking paths, courtyards and gardens, our cottages feel like charming country homes. But what truly makes our retirement community special are the friends and neighbors that live here and the compassionate, caring staff who anticipate your every need. Located just one mile south of I-90, we are close to shopping at Gilman Village, delicious restaurants, and state-of-the-art medical facilities.\r\n<br /><br />\r\nVisit Aegis of Issaquah today and take a tour of our Aegis of Issaquah assisted living and memory care retirement community.",
            "averageCost": null,
            "averageRating": 4.1111,
            "foodRating": 0,
            "reviewCount": 9,
            "url": "https://www.caring.com/senior-living/washington/issaquah/aegis-of-issaquah-98027",
            "websiteUrl": "http://www.aegisliving.com",
            "primaryPhoneNumber": {
              "e164": "+14253928100",
              "formatted": "(425) 392-8100"
            }
          },
          {
            "id": "1224676",
            "name": "The Courtyard at CRISTA",
            "addressLine1": "19327 King�s Garden DR N",
            "addressLine2": null,
            "postalCode": "98133",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 4,
            "foodRating": 0,
            "reviewCount": 6,
            "url": "https://www.caring.com/senior-living/washington/shoreline/the-courtyard-at-crista",
            "websiteUrl": "http://www.cristaseniors.com",
            "primaryPhoneNumber": {
              "e164": "+12065467575",
              "formatted": "(206) 546-7575"
            }
          },
          {
            "id": "1203893",
            "name": "Lakeview of Kirkland",
            "addressLine1": "6505 Lakeview Drive NE",
            "addressLine2": "",
            "postalCode": "98033",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "<p>We offer a home like setting and cheerful smiles from our professional staff who greet you every day. Our caring staff offers the assistance you need while respecting your independence.</p>\r\r<p>Our peaceful setting, restaurant style dining experience, activities and beautiful setting combine to create a wonderful living environment everyday. Our genuine caring staff, home style meals, daily activities add to our residents' experience.</p>\r\r<p>Through special events, activities, clubs and ongoing cultural enrichment programs, we offer unlimited opportunities for you to get to know other residents and us. Call to set up an appointment for a tour because we delight in showing you our home.</p>\r\r\r<h5>Amenities and Services</h5>\r<ul>\r<li>Daily assistance with bathing and dressing</li>\r<li>Medication management</li>\r<li>Dining assistance and special diets</li>\r<li>Assistance with reminders and redirection</li>\r<li>Escorts and assistance with walking</li>\r<li>Emergency response call system</li>\r<li>Housekeeping</li>\r<li>Laundry and linen service</li>\r </ul>\r<p><i>*Rates subject to change at any time. Level of care not included.</i></p>",
            "averageCost": null,
            "averageRating": 3.3333,
            "foodRating": 0,
            "reviewCount": 9,
            "url": "https://www.caring.com/senior-living/washington/kirkland/lakeview-of-kirkland",
            "websiteUrl": "http://www.emeritus.com/washington/kirkland/emeritus-kirkland?track=CARE",
            "primaryPhoneNumber": {
              "e164": "+14258036911",
              "formatted": "(425) 803-6911"
            }
          },
          {
            "id": "1177923",
            "name": "Aegis Lodge",
            "addressLine1": "12629 116th Avenue NE",
            "addressLine2": null,
            "postalCode": "98034",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "Aegis Lodge offers a warm and welcoming atmosphere for seniors who would like to enjoy retirement living, assisted living and memory care. A community where seniors can make their one and only move as our progressive care will meet all of their assisted living and memory care needs.\r\n<br /><br />\r\nWe are a mid size community that offers a great balance between retirement living and aging with dignity. Our residents remain very active when living at our community. Residents receiving assisted living, Alzheimer's care and Parkinson's care also have the ability to remain as independent as possible by taking advantage of our wellness programs and onsite physical, occupational and speech therapy.\r\n<br /><br />\r\nAegis Lodge has been providing excellent care since 1990, this community is surrounded by a walking trail and five acres of protected wetlands, our residents can enjoy a day of gardening, a walking trip, a trip to an off-site heated pool for therapy, painting, crafting, a scenic drive and many other activities personalized to their needs.\r\n<br /><br />\r\nOur holistic approach for assisted living and memory care will allow your loved one to receive great nutrition, care and the needed stimulation to stay healthy for many more years.\r\n<br /><br />\r\nFor reviews on our community recently given by our family members please go to our news page. Aegis Lodge has a great level of satisfaction among their residents and family members and we look forward to welcoming you to our family.",
            "averageCost": null,
            "averageRating": 4,
            "foodRating": 0,
            "reviewCount": 8,
            "url": "https://www.caring.com/senior-living/washington/kirkland/aegis-lodge",
            "websiteUrl": "http://www.aegisliving.com",
            "primaryPhoneNumber": {
              "e164": "+14259689239",
              "formatted": "(425) 968-9239"
            }
          },
          {
            "id": "45043",
            "name": "Redmond Heights Senior Living",
            "addressLine1": "7950 Willows Road NE",
            "addressLine2": null,
            "postalCode": "98052",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "Redmond Heights Senior Living has the highest level of medical care available in assisted living on the Eastside, set in our welcoming country estate surroundings. We also offer secure Memory Care with ALLPRIVATE rooms in a completely secure wing. Our memory care pricing includes ALL care, from assistance with feeding to medication management!\r\n<br /><br />\r\nThe highest compliment we receive is that our staff truly cares about our residents and their families. We go above and beyond to guarantee the health, safety and well being of our residents.  We do everything we possibly can to make certain that everyone living here has the quality of life that encompasses everything they enjoy. That includes food, activities and an environment that is welcoming and comfortable.\r\n<br /><br />\r\nWe also have Short Stay options, Adult Day Programs and great activities to put the fun in your day. Enjoy great meals in a lovely dining room, take a trip in our new van or just enjoy the company of fellow residents. Come for a visit and join us for a complimentary lunch while you're here!",
            "averageCost": 3000,
            "averageRating": 3.75,
            "foodRating": 0,
            "reviewCount": 8,
            "url": "https://www.caring.com/senior-living/washington/redmond/redmond-heights-senior-living-98052",
            "websiteUrl": "http://www.RedmondHeightsSeniorLiving.com",
            "primaryPhoneNumber": {
              "e164": "+14258854157",
              "formatted": "(425) 885-4157"
            }
          },
          {
            "id": "1249156",
            "name": "Merrill Gardens at Burien",
            "addressLine1": "15020 5th Ave SW",
            "addressLine2": null,
            "postalCode": "98166",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "<p>Welcome to Merrill Gardens at Burien, an apartment-style senior living community offering the amenities of home without the work.</p>\r\n\r\n<p>Located in downtown Burien, this new senior living community offers a blend of traditional architecture and modern elements. A courtyard and amphitheater will be open to the public and will be adjacent to the existing town center park.</p>\r\n\r\n<p>In addition, Merrill Gardens at Burien will offer concierge services, scheduled transportation, weekly housekeeping and much more!</p>",
            "averageCost": null,
            "averageRating": 3.7143,
            "foodRating": 0,
            "reviewCount": 7,
            "url": "https://www.caring.com/senior-living/washington/burien/merrill-gardens-at-burien-98166",
            "websiteUrl": "",
            "primaryPhoneNumber": {
              "e164": "+12065394995",
              "formatted": "(206) 539-4995"
            }
          },
          {
            "id": "44922",
            "name": "The Gardens at Town Square",
            "addressLine1": "933 111Th Avenue NE",
            "addressLine2": null,
            "postalCode": "98004",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "<p>Welcome to The Gardens at Town Square, an Era Living community. The Gardens offers a warm, vibrant lifestyle, a vast array of amenities, rich programming, and exceptional Independent Living, Assisted Living, and Memory Care.</p>\r\n\r\n<p>Located in the heart of downtown Bellevue, The Gardens is just steps from the finest shopping, restaurants, art galleries, the library, and much more. There are 167 apartments ranging from spacious studios to expansive penthouse suites.</p>\r\n\r\n<p>Residents of The Gardens experience a maintenance-free lifestyle, including a full service restaurant with chef-prepared selections, on-site Wellness Center staffed by a Registered Nurse, weekly housekeeping and linen services, scheduled transportation and professionally maintained common areas and gardens.</p>\r\n\r\n<p>Residents enjoy choosing from nearly 200 Life Enrichment events each month, including regular outings to the symphony and other cultural events, a variety of fitness and health classes, lectures, garden parties, chef demos, wine and jazz concerts, professionally curated art galas, and much more. Residents find that there are endless opportunities to pursue their passions, mingle with good friends, or simply sit back and enjoy the ambiance.</p>\r\n\r\n<p>In addition to Independent Living and Assisted Living, The Gardens’ integrated campus offers secured assisted living residences at The Terrace for those with dementia, Alzheimer’s or cognitive impairment. The Terrace features 26 private studio apartments, allowing residents to maintain their dignity and independence.</p>\r\n\r\n\r\n<p> *Rates are subject to change; care fees are not included in the monthly rate.</p>",
            "averageCost": null,
            "averageRating": 3.4286,
            "foodRating": 0,
            "reviewCount": 7,
            "url": "https://www.caring.com/senior-living/washington/bellevue/the-gardens-at-town-square-98004",
            "websiteUrl": "http://www.eraliving.com/communities/bellevue",
            "primaryPhoneNumber": {
              "e164": "+14256881900",
              "formatted": "(425) 688-1900"
            }
          },
          {
            "id": "1176355",
            "name": "Callahan House at Aegis of Shoreline",
            "addressLine1": "15100 1st Avenue Northeast",
            "addressLine2": null,
            "postalCode": "98155",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "Callahan House at Aegis of Shoreline is part of a campus-like retirement community offering a range of care and lifestyle options. The Callahan House offers assisted living services within a comfortable retirement community and dedicated Alzheimer's and dementia care.\r\n<br /><br />\r\nOur innovative memory care program is designed with around-the-clock care to help alleviate stress and anxiety and make life more enjoyable. We have developed our communities specifically for people with memory loss. Our apartments are easy to navigate, we have licensed nurses on staff and our activities provide cognitive and physical stimulation to help soothe and relieve the effects of Alzheimer's and dementia. We continually focus on socialization which is paramount to health and well being.\r\n<br /><br />\r\nCaring for a family member with dementia can be extremely difficult. The increased responsbility and emotional burden can easily cause stress and anxiety. This is why we believe in our neighborhood approach. These tasks are now shared by a number of dedicated individuals trained in caring for Alzheimer's and demenita. With the knowledge that your loved one is well cared for, you can enjoy more fulfilling time together and less stress.\r\n<br /><br />\r\nCallahan House provides the upmost professional and compassionate staff that makes our community feel like home. Every day is welcomed with a bright smile and life's details are taken care of with the attention you expect from family.\r\n<br /><br />\r\nWe welcome you to visit our close-knit Aegis of Shoreline retirement community and experience the feeling of family. Call or stop by today to find out more!",
            "averageCost": null,
            "averageRating": 3.4286,
            "foodRating": 0,
            "reviewCount": 7,
            "url": "https://www.caring.com/senior-living/washington/shoreline/callahan-house-at-aegis-of-shoreline-98155",
            "websiteUrl": "http://www.aegisliving.com",
            "primaryPhoneNumber": {
              "e164": "+12063885060",
              "formatted": "(206) 388-5060"
            }
          },
          {
            "id": "1234613",
            "name": "Chateau Valley Center",
            "addressLine1": "4450 Davis Avenue South,",
            "addressLine2": "",
            "postalCode": "98055",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 5,
            "foodRating": 0,
            "reviewCount": 1,
            "url": "https://www.caring.com/senior-living/washington/renton/chateau-valley-center-98055",
            "websiteUrl": "http://www.chateau-valley-center.com/",
            "primaryPhoneNumber": {
              "e164": "+14253364257",
              "formatted": "(425) 336-4257"
            }
          },
          {
            "id": "1229132",
            "name": "Evergreen Court",
            "addressLine1": "900 124th Avenue NE",
            "addressLine2": null,
            "postalCode": "98005",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 4.1667,
            "foodRating": 0,
            "reviewCount": 6,
            "url": "https://www.caring.com/senior-living/washington/bellevue/evergreen-court-98005",
            "websiteUrl": "http://www.myevergreencourt.com/Apartments/module/property_info/property[id]/34799/launch_guest_card/1/",
            "primaryPhoneNumber": {
              "e164": "+14254554333",
              "formatted": "(425) 455-4333"
            }
          },
          {
            "id": "44964",
            "name": "Rosewood Courte Memory Care in Edmonds",
            "addressLine1": "728 Edmonds Way",
            "addressLine2": null,
            "postalCode": "98020",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 4,
            "foodRating": 0,
            "reviewCount": 6,
            "url": "https://www.caring.com/senior-living/washington/edmonds/rosewood-courte-memory-care-in-edmonds",
            "websiteUrl": "http://www.rosewoodcourte.com",
            "primaryPhoneNumber": {
              "e164": "+14256732875",
              "formatted": "(425) 673-2875"
            }
          },
          {
            "id": "1177917",
            "name": "Aegis of Kirkland",
            "addressLine1": "13000 Totem Lake Boulevard",
            "addressLine2": null,
            "postalCode": "98034",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "Charming and intimate describes Ãegis of Kirkland, where we specialize in assisted living and dementia care. With fresh baked bread every day, a welcoming secured courtyard for relaxing strolls, and a private dining room to host friends and family, this is home as it was meant to be.\r\n<br /><br />\r\nAegis of Kirkland is conveniently located in the heart of our Eastside medical community. We are within walking distance to the Evergreen Hospital campus and several clinics, including Virginia Mason and Pacific Medical Center. This setting helps facilitate close partnerships on expert medical care.\r\n<br /><br />\r\nSpecializing in assisted living and dementia care, Ãegis of Kirkland offers a holistic approach and a high level of care to residents in our 37 apartments, which are situated in an elegant setting. With 10 years of expertise, Ãegis of Kirkland understands all levels of Alzheimer's dementia and other memory loss conditions.   \r\n<br /><br />\r\nWe understand the care needs of seniors and partner with each resident to ensure their wellbeing. Our experienced Care Managers provide support while enabling each senior to maintain his or her lifestyle and sense of independence. Ãegis of Kirkland is known for our nursing coverage seven days a week.",
            "averageCost": null,
            "averageRating": 3.6667,
            "foodRating": 0,
            "reviewCount": 6,
            "url": "https://www.caring.com/senior-living/washington/kirkland/aegis-of-kirkland-98034",
            "websiteUrl": "http://www.aegisliving.com",
            "primaryPhoneNumber": {
              "e164": "+14259689238",
              "formatted": "(425) 968-9238"
            }
          },
          {
            "id": "44930",
            "name": "Riverside East",
            "addressLine1": "10315 E Riverside Drive",
            "addressLine2": null,
            "postalCode": "98011",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "<p>Riverside East is conveniently located on East Riverside Drive in downtown Bothell, neighboring the award-winning Northshore Senior Center and close to the Northshore Wellness Center. Evergreen Hospital and the cities of Kirkland,\r\nBellevue, and Mill Creek are only minutes away. At Riverside East you will experience a rewarding and active lifestyle, with fun-filled activities, scheduled outings and tours.</p>\r\n<p>By using a simple yet comprehensive fee schedule, our retirement community offers you the security and freedom of a healthy, independent lifestyle…without the time-consuming responsibilities of expensive home ownership.</p>\r\n<p>At Riverside East, we strive to enhance the quality of your life. Whether you are pursuing an active, independent lifestyle or you require more personal living\r\nassistance.</p>",
            "averageCost": null,
            "averageRating": 3.8,
            "foodRating": 0,
            "reviewCount": 5,
            "url": "https://www.caring.com/senior-living/washington/bothell/riverside-east-98011",
            "websiteUrl": "http://www.villageconcepts.com",
            "primaryPhoneNumber": {
              "e164": "+14254811976",
              "formatted": "(425) 481-1976"
            }
          },
          {
            "id": "1225046",
            "name": "Aljoya Mercer Island",
            "addressLine1": "2430 76th Avenue SE",
            "addressLine2": null,
            "postalCode": "98040",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "<p>Welcome to Aljoya Mercer Island, an Era Living community. Aljoya offers a warm, vibrant lifestyle, a vast array of amenities, rich programming, and exceptional Independent Living, Assisted Living, and wellness nursing services.</p>\r\n\r\n<p>Aljoya is located in the heart of Mercer Island, surrounded by shops, restaurants, cafes, walking paths, and Sculpture Park. Aljoya has 114 upscale residences, ranging from 750 to 2,000-square-feet.</p>\r\n\r\n<p>Residents of Aljoya experience a maintenance-free lifestyle, including a full service restaurant with chef-prepared selections, on-site Wellness Center staffed by a Registered Nurse, weekly housekeeping and linen services, scheduled transportation and professionally maintained common areas and gardens.</p>\r\n\r\n<p>Residents enjoy choosing from nearly 200 Life Enrichment events each month, including regular outings to the symphony and other cultural events, a variety of fitness, aquatic, and health classes, lectures, garden parties, chef demos, wine and jazz concerts, professionally curated art galas, and much more. Residents find that there are endless opportunities to pursue their passions, mingle with good friends, or simply sit back and enjoy the ambiance.</p>\r\n\r\n\r\n<h3>WHAT MAKES US SPECIAL</H3>\r\n\r\n<p>Era Living, a respected and recognized leader in retirement living throughout the Puget Sound, is a private, Seattle-based company founded by Eli and Rebecca Almo. Since 1987, Era Living has been dedicated to fostering a healthy and engaging environment of whole body wellness, culture, warmth and social fulfillment, providing exceptional healthcare services and enriching activities at all eight communities. Era Living's Wellness and Active Aging Programs are developed in collaboration with the University of Washington School of Nursing - one of the nation's top-rated nursing schools. It's this type of innovative and vibrant approach to senior living that makes Era Living communities so desirable.</p>\r\n",
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/mercer-island/aljoya-98040",
            "websiteUrl": "http://www.eraliving.com/communities/mercer-island",
            "primaryPhoneNumber": {
              "e164": "+12062300150",
              "formatted": "(206) 230-0150"
            }
          },
          {
            "id": "45045",
            "name": "Aegis of Marymoor",
            "addressLine1": "4585 W Lake Sammamish Pkwy NE",
            "addressLine2": null,
            "postalCode": "98052",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 4.6,
            "foodRating": 4.66666666666667,
            "reviewCount": 5,
            "url": "https://www.caring.com/senior-living/washington/redmond/aegis-of-marymoor",
            "websiteUrl": "http://www.themarymoor.com",
            "primaryPhoneNumber": {
              "e164": "+14255569398",
              "formatted": "(425) 556-9398"
            }
          },
          {
            "id": "1176353",
            "name": "Aegis of Redmond",
            "addressLine1": "7480 West Lake Samm Pkwy Ne",
            "addressLine2": null,
            "postalCode": "98052",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "Aegis of Redmond creates \"home\" amidst a bed and breakfast setting where your loved one can live, laugh, and enjoy life while watching the waters of the Sammamish River drift by. Life begins again at Aegis of Redmond.\r\n<br /><br />\r\nNestled along the Sammamish River and Burk-Gilman Trail, Aegis of Redmond is a senior living retirement community.  We are conveniently located just blocks from the Redmond Senior Center, King County Library, Redmond Town Center, Redmond City Hall and the Redmond Transit Center for Metro and Sound Transit.\r\n<br /><br />\r\nAegis of Redmond offers the following services: Assisted Living, Memory Care, Short-term and Vacation Stays, Post-hospital and Respite Stays, Day Stays, and Hospice Care. ",
            "averageCost": null,
            "averageRating": 4.4,
            "foodRating": 4,
            "reviewCount": 5,
            "url": "https://www.caring.com/senior-living/washington/redmond/aegis-of-redmond-98052",
            "websiteUrl": "http://www.aegisliving.com",
            "primaryPhoneNumber": {
              "e164": "+14259689244",
              "formatted": "(425) 968-9244"
            }
          },
          {
            "id": "1240588",
            "name": "Vineyard Park at Mountain Terrace",
            "addressLine1": "23008 56th Ave. W. Mountlake terrace",
            "addressLine2": null,
            "postalCode": "98043",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 4.4,
            "foodRating": 0,
            "reviewCount": 5,
            "url": "https://www.caring.com/senior-living/washington/mountlake-terrace/vineyard-park-at-mountain-terrace-98043",
            "websiteUrl": "",
            "primaryPhoneNumber": {
              "e164": "+14256786008",
              "formatted": "(425) 678-6008"
            }
          },
          {
            "id": "44963",
            "name": "Edmonds Landing",
            "addressLine1": "180 Second Avenue",
            "addressLine2": null,
            "postalCode": "98020",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 4,
            "foodRating": 0,
            "reviewCount": 4,
            "url": "https://www.caring.com/senior-living/washington/edmonds/edmonds-landing-edmonds",
            "websiteUrl": "http://www.edmondslanding.com",
            "primaryPhoneNumber": {
              "e164": "+14253296599",
              "formatted": "(425) 329-6599"
            }
          },
          {
            "id": "1201484",
            "name": "Aegis of Bellevue",
            "addressLine1": "148 102nd Ave SE",
            "addressLine2": null,
            "postalCode": "98004",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "The team at Aegis of Bellevue is delighted to welcome you to come and experience our newest Assisted Living and Memory Care community! Located in Old Bellevue just off Main Street and near Meydenbauer Bay, our residents and their families are passionate about our desirable location and exceptional services.\r\n<br /><br />\r\nÃegis of Bellevue is steps away from Wildwood Park, Meydenbauer Park, Bellevue Downtown Park and the Bellevue Collection shopping district. Our downtown location fosters an environment for unique cultural involvement.\r\n<br /><br />\r\nAegis of Bellevue features a selection of spacious studios, one and two bedroom apartments. With several floor plans, we invite you to come and determine the best layout for your lifestyle and needs. Our community also offers a comprehensive partnership with any care needs. Our experienced care staff are available 24 hours a day to assist residents with any service. Aegis of Bellevue is also known for our nursing coverage seven day a week.\r\n<br /><br />\r\nOur community features many welcoming common areas. Enjoy a cup of coffee with friends at our Bistro, share a book next to the fireplace in our cozy library, exercise in our full service fitness center with Technogym equipment or enjoy a movie in our state of the art theater. Some of our activities include walking club, Tai Chi, happy hour with live entertainment, shopping, and art classes. We also have several outdoor gathering places including an area with a fireplace to enjoy the cool Summer nights or crisp Fall days.\r\n<br /><br />\r\nLet our concierge help coordinate additional services of massage therapy, a hair salon, pet care, dry cleaning and room service to name just a few.\r\n<br /><br />\r\nAdjoining is a designated section of our community with secured Memory Care. For those individuals living with Alzheimer's or dementia we have a highly dedicated and trained staff. In our secured memory care community, Life's Neighborhood, we utilize innovative programs which has helped make us an industry leader. This type of cutting edge care uses sensory stimulation as a method of relaxation and redirection, thus reducing the use of medication. Life's Neighborhood is a safe, secure home for your family member where they can make friends and continue to enjoy a wonderful life",
            "averageCost": null,
            "averageRating": 3.8,
            "foodRating": 0,
            "reviewCount": 5,
            "url": "https://www.caring.com/senior-living/washington/bellevue/aegis-of-bellevue-98004",
            "websiteUrl": "http://www.aegisliving.com",
            "primaryPhoneNumber": {
              "e164": "+14252961293",
              "formatted": "(425) 296-1293"
            }
          },
          {
            "id": "1235785",
            "name": "Patriots Glen",
            "addressLine1": "1640 148th Ave SE",
            "addressLine2": null,
            "postalCode": "98007",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "Located in the lovely Lake Hills neighborhood of southeast Bellevue, Patriots Glen is a community dedicated to  promoting maximum independence for our residents while providing compassionate and supportive care in a warm and homelike setting. Senior Living, Assisted Living and Memory Care are all offered in one gracious location.",
            "averageCost": 4000,
            "averageRating": 3.8,
            "foodRating": 0,
            "reviewCount": 5,
            "url": "https://www.caring.com/senior-living/washington/bellevue/patriot-glen-98007",
            "websiteUrl": "http://patriotsglen.net/contact-us/",
            "primaryPhoneNumber": {
              "e164": "+14254173996",
              "formatted": "(425) 417-3996"
            }
          },
          {
            "id": "44931",
            "name": "Vineyard Park at Bothell Landing",
            "addressLine1": "10519 E Riverside Drive",
            "addressLine2": null,
            "postalCode": "98011",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 3.4,
            "foodRating": 0,
            "reviewCount": 5,
            "url": "https://www.caring.com/senior-living/washington/bothell/vineyard-park-at-bothell-landing-98011",
            "websiteUrl": "http://www.vineyardpark.net",
            "primaryPhoneNumber": {
              "e164": "+14253543914",
              "formatted": "(425) 354-3914"
            }
          },
          {
            "id": "1237137",
            "name": "GenCare Lynnwood at Scriber Gardens",
            "addressLine1": "6024 200th Street SW",
            "addressLine2": null,
            "postalCode": "98036",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 3,
            "foodRating": 0,
            "reviewCount": 3,
            "url": "https://www.caring.com/senior-living/washington/lynnwood/gencare-lynnwood-at-scriber-gardens-98036",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+14253294428",
              "formatted": "(425) 329-4428"
            }
          },
          {
            "id": "45044",
            "name": "Peters Creek Retirement and Assisted Living",
            "addressLine1": "14431 Redmond Way",
            "addressLine2": "",
            "postalCode": "98052",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 3.5,
            "foodRating": 0,
            "reviewCount": 4,
            "url": "https://www.caring.com/senior-living/washington/redmond/peters-creek-retirement-community-98052",
            "websiteUrl": "http://www.regencypeterscreek.com/",
            "primaryPhoneNumber": {
              "e164": "+14258692273",
              "formatted": "(425) 869-2273"
            }
          },
          {
            "id": "1220125",
            "name": "Aegis Living of Shoreline",
            "addressLine1": "14900 1st Avenue NE ",
            "addressLine2": null,
            "postalCode": "98155",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 4.6667,
            "foodRating": 0,
            "reviewCount": 3,
            "url": "https://www.caring.com/senior-living/washington/shoreline/aegis-living-of-shoreline",
            "websiteUrl": "",
            "primaryPhoneNumber": {
              "e164": "+12063885045",
              "formatted": "(206) 388-5045"
            }
          },
          {
            "id": "1227334",
            "name": "Spiritwood at Pine Lake",
            "addressLine1": "3607 228th Ave SE",
            "addressLine2": null,
            "postalCode": "98029",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "<p>Nestled among the pines on three wooded acres on the Sammamish Plateau, just\r\nnorth of beautiful Issaquah and east of Lake Sammamish, Spiritwood at Pine Lake truly allows you to relax and enjoy retirement in a beautiful setting close to medical services and city conveniences.</p>\r\n<p>Friends and family draw together in intimate gathering spaces. Visitors and residents\r\nenjoy our beautiful outdoor courtyard and our spacious dining and living rooms are warmed by an inviting stone fireplace. Common areas include a busy activity center,\r\nlibrary, quiet chapel, and a full service beauty/barber shop.\r\nOur retirement and assisted living community offers you the security and freedom of a healthy, independent lifestyle…without the time-consuming responsibilities of\r\nexpensive home ownership. At Spiritwood at Pine Lake, we strive to enhance the quality of your life.</p>\r\n<p>Whether you are pursuing an active, independent lifestyle or you\r\nrequire more personal living assistance, our community is safe, secure and friendly.</p>",
            "averageCost": null,
            "averageRating": 4.3333,
            "foodRating": 0,
            "reviewCount": 3,
            "url": "https://www.caring.com/senior-living/washington/issaquah/spiritwood-at-pine-lake-98029",
            "websiteUrl": "http://www.villageconcepts.com",
            "primaryPhoneNumber": {
              "e164": "+14253139100",
              "formatted": "(425) 313-9100"
            }
          },
          {
            "id": "1241262",
            "name": "Regency Newcastle",
            "addressLine1": "7454 Newcastle Golf Club Road",
            "addressLine2": null,
            "postalCode": "98059",
            "isEnhanced": false,
            "isCareHome": true,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 2,
            "foodRating": 0,
            "reviewCount": 2,
            "url": "https://www.caring.com/senior-living/washington/renton/regency-newcastle-98059",
            "websiteUrl": "http://www.regencynewcastle.com/",
            "primaryPhoneNumber": {
              "e164": "+14254531508",
              "formatted": "(425) 453-1508"
            }
          },
          {
            "id": "1362146",
            "name": "Blue Haven Adult Family Home",
            "addressLine1": "655 South 189th Street",
            "addressLine2": null,
            "postalCode": "98148",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 5,
            "foodRating": 0,
            "reviewCount": 2,
            "url": "https://www.caring.com/senior-living/washington/burien/blue-haven-adult-family-home",
            "websiteUrl": "http://www.bluehavenseniorcare.com/contact.html",
            "primaryPhoneNumber": null
          },
          {
            "id": "1242749",
            "name": "Bethany Adult Family Home",
            "addressLine1": "4506 NE 17th Street",
            "addressLine2": null,
            "postalCode": "98059",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 4.5,
            "foodRating": 0,
            "reviewCount": 2,
            "url": "https://www.caring.com/senior-living/washington/renton/bethany-adult-family-home-98059",
            "websiteUrl": "http://bethanyafhinc.webplus.net/contact%20us.html",
            "primaryPhoneNumber": {
              "e164": "+14252548820",
              "formatted": "(425) 254-8820"
            }
          },
          {
            "id": "1236303",
            "name": "Bellevue Heights Adult Family Home",
            "addressLine1": "505 140th Avenue Southeast",
            "addressLine2": null,
            "postalCode": "98005",
            "isEnhanced": false,
            "isCareHome": true,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 4,
            "foodRating": 0,
            "reviewCount": 2,
            "url": "https://www.caring.com/senior-living/washington/bellevue/bellevue-heights-adult-family-home",
            "websiteUrl": "",
            "primaryPhoneNumber": {
              "e164": "+12069200505",
              "formatted": "(206) 920-0505"
            }
          },
          {
            "id": "1234344",
            "name": "Madison Avenue House",
            "addressLine1": "285 Madison Avenue South",
            "addressLine2": null,
            "postalCode": "98110",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 4,
            "foodRating": 0,
            "reviewCount": 2,
            "url": "https://www.caring.com/senior-living/washington/bainbridge-island/madison-avenue-house-98110",
            "websiteUrl": "http://www.bainbridgeseniorliving.com/madisonhouse.php",
            "primaryPhoneNumber": {
              "e164": "+12068423694",
              "formatted": "(206) 842-3694"
            }
          },
          {
            "id": "1230989",
            "name": "Progress Adult Family Home",
            "addressLine1": "4766 130th Avenue",
            "addressLine2": null,
            "postalCode": "98006",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 5,
            "foodRating": 0,
            "reviewCount": 1,
            "url": "https://www.caring.com/senior-living/washington/bellevue/progress-adult-family-home-98006",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+14254447735",
              "formatted": "(425) 444-7735"
            }
          },
          {
            "id": "1238568",
            "name": "Wyatt House",
            "addressLine1": "186 Wyatt Way NW",
            "addressLine2": null,
            "postalCode": "98110",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 5,
            "foodRating": 0,
            "reviewCount": 1,
            "url": "https://www.caring.com/senior-living/washington/bainbridge-island/wyatt-house-98110",
            "websiteUrl": "http://www.bainbridgeseniorliving.com/assistedliving/wyatthouse",
            "primaryPhoneNumber": {
              "e164": "+12067803646",
              "formatted": "(206) 780-3646"
            }
          },
          {
            "id": "1236247",
            "name": "Cedar Park Adult Family Home ",
            "addressLine1": "11110 NE 164th Pl",
            "addressLine2": null,
            "postalCode": "98011",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 5,
            "foodRating": 0,
            "reviewCount": 1,
            "url": "https://www.caring.com/senior-living/washington/bothell/cedar-park-adult-family-home-98011",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+14254891816",
              "formatted": "(425) 489-1816"
            }
          },
          {
            "id": "1239118",
            "name": "Willowcreek Adult Family Home",
            "addressLine1": "960 Peru Avenue E",
            "addressLine2": null,
            "postalCode": "98366",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 5,
            "foodRating": 0,
            "reviewCount": 1,
            "url": "https://www.caring.com/senior-living/washington/port-orchard/willowcreek-adult-family-home",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+13608719418",
              "formatted": "(360) 871-9418"
            }
          },
          {
            "id": "1227916",
            "name": "Canyon Park Adult Family Homes",
            "addressLine1": "1410 233RD PL SE",
            "addressLine2": null,
            "postalCode": "98021",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 5,
            "foodRating": 0,
            "reviewCount": 1,
            "url": "https://www.caring.com/senior-living/washington/bothell/canyon-park-adult-family-homes",
            "websiteUrl": "http://www.canyonparkhome.com/index.html",
            "primaryPhoneNumber": {
              "e164": "+12063551410",
              "formatted": "(206) 355-1410"
            }
          },
          {
            "id": "1233662",
            "name": "Agape Senior ",
            "addressLine1": "22305 Northeast 30th St.",
            "addressLine2": null,
            "postalCode": "98074",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "\r\n<p> Quality care and personal attention for seniors, in a warm, caring & family atmosphere. Our unique services, attention to detail, and \"a commitment to caring\" all make choosing Agape Senior Living on the Plateau the right choice for your aging loved one.\r\n</p>\r\n<h4>Our Family is Committed to Yours\r\n</h4>\r\n<h5>Amenities and Services</h5>\r\n\r\n<ul>\r\n\r\n<li>24 hr. Professional CNA care, Doctor & RN on call</li>\r\n<li>Doctor, Podiatrist & Dental House Calls</li>\r\n<li>Medication management</li>\r\n<li>Three nutritious home-cooked meals & frequent snacks with dietary modifications</li>\r\n<li>Dining assistance and special diets (Diabetic diet, low sodium, low fat, low carbohydrates, soft foods, & tube feeding)</li>\r\n<li>Assistance & supervision with activities of daily living routines</li>\r\n<li>Daily assistance with bathing, dressing/undressing, & personal hygiene </li>\r\n<li>Assistance with reminders and redirection</li>\r\n<li>Escorts and assistance with walking</li>\r\n<li>Incontinence care management & continence training/Foley Catheter management</li>\r\n<li>Housekeeping</li>\r\n<li>Personal laundry and linen services</li>\r\n\r\n</ul>\r\n\r\n\r\n\r\n<p>\"Too often we underestimate the power of a touch, a kind word, a listening ear, an honest compliment, or the smallest act of caring, all of which have the potential to turn a life around\" Leo Buscaglia\r\n</p>\r\n<p>This is our motto here at Agape Senior Living and we cant wait to meet you and give you a tour of our home.\r\n</p>",
            "averageCost": null,
            "averageRating": 5,
            "foodRating": 0,
            "reviewCount": 1,
            "url": "https://www.caring.com/senior-living/washington/sammamish/agape-senior",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+14258685061",
              "formatted": "(425) 868-5061"
            }
          },
          {
            "id": "1238159",
            "name": "Twilight Adult Family Homes",
            "addressLine1": "7430 92nd Place SE",
            "addressLine2": null,
            "postalCode": "98040",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 4,
            "foodRating": 0,
            "reviewCount": 1,
            "url": "https://www.caring.com/senior-living/washington/mercer-island/twilight-adult-family-homes-98040",
            "websiteUrl": "http://www.twilighthomes.com/overview.htm",
            "primaryPhoneNumber": {
              "e164": "+12062365166",
              "formatted": "(206) 236-5166"
            }
          },
          {
            "id": "1232499",
            "name": "Sunset Adult Family Home",
            "addressLine1": "6701 123rd Ave Seq",
            "addressLine2": null,
            "postalCode": "98006",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 4,
            "foodRating": 0,
            "reviewCount": 1,
            "url": "https://www.caring.com/senior-living/washington/bellevue/sunset-adult-family-home-98006",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+14256796502",
              "formatted": "(425) 679-6502"
            }
          },
          {
            "id": "1239308",
            "name": "Leisure Senior Care Center Adult Family Home",
            "addressLine1": "412 166Th Avenue NE",
            "addressLine2": null,
            "postalCode": "98008",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 4,
            "foodRating": 0,
            "reviewCount": 1,
            "url": "https://www.caring.com/senior-living/washington/bellevue/leisure-senior-care-center-adult-family-home-98008",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+14253730420",
              "formatted": "(425) 373-0420"
            }
          },
          {
            "id": "1236680",
            "name": "Sunset Home Care ",
            "addressLine1": "917 Lynwood Ave NE",
            "addressLine2": null,
            "postalCode": "98056",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 4,
            "foodRating": 0,
            "reviewCount": 1,
            "url": "https://www.caring.com/senior-living/washington/renton/sunset-home-care",
            "websiteUrl": "http://www.sunsethomecare.com/",
            "primaryPhoneNumber": {
              "e164": "+12539814223",
              "formatted": "(253) 981-4223"
            }
          },
          {
            "id": "1238229",
            "name": "Country Estate Union Hill",
            "addressLine1": "8720 208th Avenue NE",
            "addressLine2": null,
            "postalCode": "98053",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 4,
            "foodRating": 0,
            "reviewCount": 1,
            "url": "https://www.caring.com/senior-living/washington/redmond/country-estate-union-hill-98053",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+14258364053",
              "formatted": "(425) 836-4053"
            }
          },
          {
            "id": "44932",
            "name": "Ashley Gardens of Bremerton",
            "addressLine1": "3231 Pine Road",
            "addressLine2": null,
            "postalCode": "98310",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 4,
            "foodRating": 0,
            "reviewCount": 1,
            "url": "https://www.caring.com/senior-living/washington/bremerton/ashley-gardens-at-bremerton-98310",
            "websiteUrl": "http://www.ashleygardensofbremerton.com",
            "primaryPhoneNumber": {
              "e164": "+13604787277",
              "formatted": "(360) 478-7277"
            }
          },
          {
            "id": "1248253",
            "name": "Kelsey Creek Group Home",
            "addressLine1": "600 124Th Ave Ne",
            "addressLine2": null,
            "postalCode": "98005",
            "isEnhanced": false,
            "isCareHome": true,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/bellevue/kelsey-creek-group-home-bellevue",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+14254545622",
              "formatted": "(425) 454-5622"
            }
          },
          {
            "id": "1225167",
            "name": "Newport Glen AFH LLC",
            "addressLine1": "6520 117TH PLACE SE",
            "addressLine2": null,
            "postalCode": "98006",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/bellevue/newport-glen-afh-llc-bellevue",
            "websiteUrl": "http://eastsidecare.com",
            "primaryPhoneNumber": {
              "e164": "+12062345693",
              "formatted": "(206) 234-5693"
            }
          },
          {
            "id": "1248244",
            "name": "Champion House",
            "addressLine1": "1800 145Th Pl Se",
            "addressLine2": null,
            "postalCode": "98007",
            "isEnhanced": false,
            "isCareHome": true,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/bellevue/champion-house-bellevue",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+14256444477",
              "formatted": "(425) 644-4477"
            }
          },
          {
            "id": "1248187",
            "name": "The Gardens At Juanita Bay",
            "addressLine1": "11853 97Th Ave Ne",
            "addressLine2": null,
            "postalCode": "98034",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/kirkland/the-gardens-at-juanita-bay-kirkland",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+14258230410",
              "formatted": "(425) 823-0410"
            }
          },
          {
            "id": "1248182",
            "name": "Aegis At Callahan House",
            "addressLine1": "15100 First Avenue Ne",
            "addressLine2": null,
            "postalCode": "98155",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/shoreline/aegis-at-callahan-house-shoreline",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+12064179747",
              "formatted": "(206) 417-9747"
            }
          },
          {
            "id": "1217988",
            "name": "Bellevue Elderly Care",
            "addressLine1": "102 162nd Avenue Southeast",
            "addressLine2": null,
            "postalCode": "98008",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "West Bellevue Senior Care is an adult family home care licensed by the Washington state Department of Social and Health Services to provide care for seniors. We are dedicated to offering a comfortable, respectful, friendly, and loving family-like environment with expert quality care for four residents only. We believe in providing activities and opportunities for our residents to maintain a happy and healthy lifestyle",
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/bellevue/bellevue-elderly-care",
            "websiteUrl": "http://www.westbellevueseniorcare.com",
            "primaryPhoneNumber": {
              "e164": "+12063348906",
              "formatted": "(206) 334-8906"
            }
          },
          {
            "id": "1203303",
            "name": "Viewridge Eastside Corp",
            "addressLine1": "5406 158th PL NE",
            "addressLine2": null,
            "postalCode": "98052",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/redmond/viewridge-eastside-corp-redmond",
            "websiteUrl": "http://www.viewridgeeastside.com/",
            "primaryPhoneNumber": {
              "e164": "+14258832841",
              "formatted": "(425) 883-2841"
            }
          },
          {
            "id": "1248170",
            "name": "Anderson Plaza",
            "addressLine1": "17201 15Th Ave Ne",
            "addressLine2": null,
            "postalCode": "98155",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/shoreline/anderson-plaza-shoreline",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+12063649336",
              "formatted": "(206) 364-9336"
            }
          },
          {
            "id": "1248256",
            "name": "Bethesda Lutheran Communities 19Th Street",
            "addressLine1": "4001 Ne 19Th St",
            "addressLine2": null,
            "postalCode": "98056",
            "isEnhanced": false,
            "isCareHome": true,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/renton/bethesda-lutheran-communities-19th-street",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+14252278720",
              "formatted": "(425) 227-8720"
            }
          },
          {
            "id": "1248186",
            "name": "Aegis Senior Inn Of Redmond",
            "addressLine1": "7480 W Lake Sammamish Pkwy Ne",
            "addressLine2": null,
            "postalCode": "98052",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/redmond/aegis-senior-inn-of-redmond",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+14258834000",
              "formatted": "(425) 883-4000"
            }
          },
          {
            "id": "1248257",
            "name": "Bethesda Lutheran Communities Olympia Ave",
            "addressLine1": "1025 Olympia Ave Ne",
            "addressLine2": null,
            "postalCode": "98055",
            "isEnhanced": false,
            "isCareHome": true,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/renton/bethesda-lutheran-communities-olympia-ave",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+14252276671",
              "formatted": "(425) 227-6671"
            }
          },
          {
            "id": "1224868",
            "name": "Our House Adult Family Home",
            "addressLine1": "18531 61st Place Northeast",
            "addressLine2": null,
            "postalCode": "98028",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/kenmore/our-house-adult-family-home-kenmore",
            "websiteUrl": "http://WWW.OurHouseAFH.org",
            "primaryPhoneNumber": {
              "e164": "+14254123857",
              "formatted": "(425) 412-3857"
            }
          },
          {
            "id": "1263385",
            "name": "All About Seniors ",
            "addressLine1": "19860 15th Ave. NW",
            "addressLine2": null,
            "postalCode": "98177",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/shoreline/all-about-seniors",
            "websiteUrl": "",
            "primaryPhoneNumber": {
              "e164": "+12066975557",
              "formatted": "(206) 697-5557"
            }
          },
          {
            "id": "1217987",
            "name": "Pacific Elderly Care ",
            "addressLine1": "1906 EDMONDS DR SE ",
            "addressLine2": null,
            "postalCode": "98055",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": "Pacific Elderly Care is an adult family home care licensed by the Washington state Department of Social and Health Services to provide care for seniors. We are dedicated to offering a comfortable, respectful, friendly, and loving family-like environment with expert quality care for five residents only. We believe in providing activities and opportunities for our residents to maintain a happy and healthy lifestyle",
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/renton/pacific-elderly-care",
            "websiteUrl": "http://www.pacificelderlycare.com",
            "primaryPhoneNumber": {
              "e164": "+12064553039",
              "formatted": "(206) 455-3039"
            }
          },
          {
            "id": "1248259",
            "name": "Inglewood Group Home",
            "addressLine1": "7911 Ne 195Th St",
            "addressLine2": null,
            "postalCode": "98028",
            "isEnhanced": false,
            "isCareHome": true,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/kenmore/inglewood-group-home-kenmore",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+14254831141",
              "formatted": "(425) 483-1141"
            }
          },
          {
            "id": "1248254",
            "name": "Bethesda Lutheran Communities 105Th Ave",
            "addressLine1": "17019 105Th Ave Se",
            "addressLine2": null,
            "postalCode": "98055",
            "isEnhanced": false,
            "isCareHome": true,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/renton/bethesda-lutheran-communities-105th-ave",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+14252276673",
              "formatted": "(425) 227-6673"
            }
          },
          {
            "id": "1248255",
            "name": "Bethesda Lutheran Communities 113Th Ave",
            "addressLine1": "16642 113Th Ave Se",
            "addressLine2": null,
            "postalCode": "98055",
            "isEnhanced": false,
            "isCareHome": true,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/renton/bethesda-lutheran-communities-113th-ave",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+14252278736",
              "formatted": "(425) 227-8736"
            }
          },
          {
            "id": "1248175",
            "name": "Falcon Ridge Assisted Living",
            "addressLine1": "21202 International Blvd",
            "addressLine2": null,
            "postalCode": "98198",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/seatac/falcon-ridge-assisted-living-seatac",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+12068780900",
              "formatted": "(206) 878-0900"
            }
          },
          {
            "id": "1248250",
            "name": "Smithwright Group Home",
            "addressLine1": "8425 Bowdoin Way",
            "addressLine2": null,
            "postalCode": "98026",
            "isEnhanced": false,
            "isCareHome": true,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": 0,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/edmonds/smithwright-group-home",
            "websiteUrl": null,
            "primaryPhoneNumber": {
              "e164": "+14256738052",
              "formatted": "(425) 673-8052"
            }
          },
          {
            "id": "1368799",
            "name": "The Park at Belle Harbour",
            "addressLine1": "2110 116th Ave NE",
            "addressLine2": "",
            "postalCode": "98004",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": null,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/bellevue/the-park-at-belle-harbour",
            "websiteUrl": "",
            "primaryPhoneNumber": {
              "e164": "+14252121165",
              "formatted": "(425) 212-1165"
            }
          },
          {
            "id": "1363254",
            "name": "Hillwood Senior Care ",
            "addressLine1": "18319 3rd Avenue NE",
            "addressLine2": null,
            "postalCode": "98155",
            "isEnhanced": false,
            "isCareHome": false,
            "selfDescription": null,
            "averageCost": null,
            "averageRating": null,
            "foodRating": 0,
            "reviewCount": 0,
            "url": "https://www.caring.com/senior-living/washington/shoreline/hillwood-senior-care-shoreline-washington",
            "websiteUrl": "https://hillwoodsch.com/services",
            "primaryPhoneNumber": null
          }
        ]
      }
    }
  }
}